[
    {
        "title": "Over 1.9 Million Taxpayers to Enjoy No-Filing Service (NFS) for Tax Season 2025",
        "url": "https://www.iras.gov.sg/news-events/newsroom/over-1.9-million-taxpayers-to-enjoy-no-filing-service-(nfs)-for-tax-season-2025",
        "text": "{'content': \"The Inland Revenue Authority of Singapore (IRAS) has announced that over 1.9 million taxpayers will benefit from the No-Filing Service (NFS) for the tax season in 2025. This service simplifies the tax filing process for eligible individuals, allowing them to avoid filing income tax returns. To qualify for the NFS, taxpayers must have income solely from employment and not exceed a certain threshold. IRAS will automatically assess their income and tax obligations based on available information. The NFS aims to reduce the administrative burden on taxpayers and streamline the tax assessment process. Eligible taxpayers will receive a notification from IRAS regarding their tax assessment, which they can review and accept without needing to file a return. This initiative is part of IRAS's efforts to enhance taxpayer experience and promote compliance with tax obligations in Singapore. Taxpayers on the NFS will receive a notification of their status by March 2025. They are reminded to verify pre-filled information in their return, especially for reliefs based on the previous year's tax bill, due to changes in criteria for dependant-related tax reliefs effective from YA 2025. The filing deadline for individual taxpayers and partnerships is 18 April 2025. Tax resident individuals will automatically receive a 60% rebate on tax payable, capped at $200. Close to 500,000 taxpayers will receive their tax bills earlier from mid-March 2025 through the Direct Notice of Assessment (D-NOA) initiative. Changes to dependant-related tax reliefs have been announced, including raising the income threshold for certain reliefs. The Working Mother’s Child Relief (WMCR) will also change to a fixed dollar amount for qualifying children born or adopted on or after 1 January 2024. Taxpayers are encouraged to use secured digital payment methods for tax payments and to be vigilant against scams. For assistance, taxpayers can contact IRAS through various channels, and more information is available on their website.\", 'urls': ['https://www.iras.gov.sg']}",
        "pdfs": [],
        "tags": [
            "No-Filing Service (NFS) for self-employed persons under the pre-filling of income initiative",
            "Individual Income Tax E-filing",
            "Corporate Income Tax Filing Obligations",
            "Personal Tax rebate",
            "Auto Inclusion Scheme (AIS) for Employment Income"
        ],
        "_id": "67d16b3aaf834a8f0c318c8a",
        "summary": "The Inland Revenue Authority of Singapore (IRAS) will implement the No-Filing Service (NFS) for the 2025 tax season, benefiting over 1.9 million taxpayers. This service allows eligible individuals, who earn income solely from employment and meet specific income thresholds, to avoid filing income tax returns. Instead, IRAS will automatically assess their income and tax obligations based on available data. Notifications regarding tax assessments will be sent to eligible taxpayers by March 2025, which they can review and accept without filing a return.\n\nKey details include:\n- The filing deadline for individual taxpayers and partnerships is April 18, 2025.\n- Tax resident individuals will receive a 60% rebate on tax payable, capped at $200.\n- Approximately 500,000 taxpayers will receive their tax bills earlier via the Direct Notice of Assessment (D-NOA) initiative starting mid-March 2025.\n- Changes to dependant-related tax reliefs will take effect, including an increased income threshold and modifications to the Working Mother’s Child Relief (WMCR) for children born or adopted after January 1, 2024.\n- Taxpayers are advised to verify pre-filled information, especially regarding reliefs, and to utilize secure digital payment methods while remaining vigilant against scams. Assistance is available through IRAS's various contact channels and their website.",
        "embedding_reference": "article_0.json"
    },
    {
        "title": "Country-by-Country Reporting (CbCR)",
        "url": "https://www.iras.gov.sg/taxes/international-tax/country-by-country-reporting-(cbcr)",
        "text": "{'content': 'Singapore-based multinational enterprise (MNE) groups that meet specific criteria must prepare and submit Country-by-Country (CbC) Reports to the Inland Revenue Authority of Singapore (IRAS) for financial years starting on or after January 1, 2017, within 12 months after the end of their financial year. For financial years beginning on or after January 1, 2022, these groups must also inform IRAS of their obligation to file a CbC Report within 3 months after the end of that financial year. To file a CbC Report, the ultimate parent entity must be a tax resident in Singapore, have a consolidated group revenue of at least S$1,125 million in the preceding financial year, and have subsidiaries or operations in at least one foreign jurisdiction. CbC Reports must include information on the global allocation of income and taxes paid in different jurisdictions and will be shared with tax authorities in jurisdictions with which Singapore has agreements for automatic exchange of CbC information. Companies that fail to notify, file a CbC Report, or retain necessary documents may face penalties, including fines and imprisonment. The CbC MCAA, signed by Singapore, facilitates the automatic exchange of CbC Reports with other signatories. For more details, companies can refer to the e-Tax Guide on Country-by-Country Reporting.', 'urls': ['https://www.iras.gov.sg/taxes/international-tax/<#title1>', 'https://www.iras.gov.sg/taxes/international-tax/<#title2>', 'https://www.iras.gov.sg/taxes/international-tax/<#title3>', 'https://www.iras.gov.sg/taxes/international-tax/<#title4>', 'https://www.iras.gov.sg/taxes/international-tax/<#title5>', 'https://www.iras.gov.sg/taxes/international-tax/<#title6>', 'https://www.iras.gov.sg/taxes/international-tax/<#title7>', 'https://www.iras.gov.sg/taxes/international-tax/<#examples>', 'https://www.iras.gov.sg/taxes/international-tax/<#entities-not-required-to-notify-iras>', 'https://www.iras.gov.sg/taxes/international-tax/<#failure-to-notify--file-a-cbc-report--or-to-retain-documents-and-information>', 'https://www.iras.gov.sg/taxes/international-tax/<#false--misleading-cbc-information>', 'https://www.iras.gov.sg/taxes/international-tax/<https:/www.iras.gov.sg/media/docs/default-source/e-tax/etaxguide_income-tax_country-by-country-reporting_3rd.pdf?sfvrsn=c766a80_16>', 'https://www.iras.gov.sg/taxes/international-tax/<https:/www.oecd.org/tax/beps/beps-actions/action13/>', 'https://www.iras.gov.sg/taxes/international-tax/<https:/www.oecd.org/ctp/exchange-of-tax-information/convention-on-mutual-administrative-assistance-in-tax-matters.htm>', 'https://www.iras.gov.sg/taxes/international-tax/<https:/www.oecd.org/tax/beps/country-by-country-exchange-relationships.htm>', 'https://www.iras.gov.sg/taxes/international-tax/<#list-of-jurisdictions>', 'https://www.iras.gov.sg/taxes/international-tax/<#faqs>']}",
        "pdfs": [],
        "tags": [
            "Country-by-Country (CbC) Reporting",
            "Corporate Income Tax Filing Obligations",
            "Foreigners with side and personal income",
            "Foreign Employee",
            "Reporting Employee Earnings (IR8A, Appendix 8A, Appendix 8B, IR8S)"
        ],
        "_id": "67d16b3aaf834a8f0c318c8b",
        "summary": "**Summary of Country-by-Country Reporting (CbCR) in Singapore**\n\nMultinational enterprise (MNE) groups based in Singapore must prepare and submit Country-by-Country (CbC) Reports to the Inland Revenue Authority of Singapore (IRAS) if they meet certain criteria. This requirement applies to financial years starting on or after January 1, 2017, with reports due within 12 months after the financial year ends. Starting from financial years beginning on or after January 1, 2022, these groups must also notify IRAS of their obligation to file a CbC Report within 3 months after the end of the financial year.\n\nTo be subject to CbC reporting, the ultimate parent entity must:\n- Be a tax resident in Singapore.\n- Have a consolidated group revenue of at least S$1,125 million in the preceding financial year.\n- Have subsidiaries or operations in at least one foreign jurisdiction.\n\nCbC Reports must detail the global allocation of income and taxes paid across different jurisdictions and will be shared with tax authorities in countries that have agreements with Singapore for the automatic exchange of CbC information.\n\nPenalties for failing to notify, file a CbC Report, or retain necessary documents can include fines and imprisonment. Singapore has signed the CbC MCAA, which enables the automatic exchange of CbC Reports with other signatory countries. For further information, companies can consult the e-Tax Guide on Country-by-Country Reporting.",
        "embedding_reference": "article_1.json"
    },
    {
        "title": "Summary of Income Tax Advance Rulings Issued (3 Mar 2025)",
        "url": "https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/advance-ruling-system-for-income-tax",
        "text": "",
        "pdfs": [],
        "tags": [
            "IRAS"
        ],
        "_id": "67d16b3aaf834a8f0c318c8c"
    },
    {
        "title": "Exchange Rates",
        "url": "https://www.iras.gov.sg/quick-links/exchange-rates",
        "text": "{'content': 'For exchange rates data, please refer to the MAS website. For tax purposes, the average exchange rate for any year of assessment is calculated by summing the total end-of-month rates for the relevant basis period and dividing by the number of months in that period. For example, a company incorporated in March 2023 with its first basis period from March 2023 to December 2023 should use the average rate from March to December 2023 for its YA 2024 tax return. You can use the Exchange Rate Search Function to retrieve the average exchange rate and convert foreign currency amounts to Singapore dollars for YA 2021 onwards. Additionally, ensure you are on official government websites ending with .gov.sg and using secure HTTPS connections when sharing sensitive information.', 'urls': ['https://www.mas.gov.sg/', 'https://www.iras.gov.sg/media/docs/default-source/uploadedfiles/xlsx/exchange-rate-search-function.xlsx?sfvrsn=47c95ed9_19']}",
        "pdfs": [],
        "tags": [
            "Individual Income Tax E-filing",
            "Corporate Income Tax Filing Obligations",
            "Tax Residency of Individuals",
            "Individual Income Tax Rate",
            "Individual Income Tax Compliance"
        ],
        "_id": "67d16b3aaf834a8f0c318c8d",
        "summary": "The article outlines how to determine the average exchange rate for tax purposes in Singapore. For any year of assessment (YA), the average exchange rate is calculated by summing the total end-of-month rates for the relevant basis period and dividing by the number of months in that period. For instance, a company incorporated in March 2023 should use the average rate from March to December 2023 for its YA 2024 tax return. The Exchange Rate Search Function on the MAS website can be used to find the average exchange rate and convert foreign currency amounts to Singapore dollars for YA 2021 and onwards. It is also advised to use official government websites ending in .gov.sg and secure HTTPS connections when sharing sensitive information.",
        "embedding_reference": "article_3.json"
    },
    {
        "title": "Preparing a Tax Computation",
        "url": "https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/preparing-a-tax-computation",
        "text": "{'content': 'This article provides guidance on how to identify official Singapore government websites, prepare tax computations, and understand tax rates for the Years of Assessment (YA) 2024 and 2025. It emphasizes that official websites end with .gov.sg and should use HTTPS for security. Companies must prepare their tax computations in Singapore dollars (S$) even if their financial statements are in another currency. The article outlines the necessary adjustments to be made to arrive at chargeable income, including non-deductible expenses and non-taxable receipts. It also discusses the impact of changes in financial year ends on tax computations and provides links to useful tools, such as tax calculators and basic formats for tax computations specific to different industries. Additionally, it explains the translation of amounts for companies using non-S$ functional currencies and the average exchange rate calculation for tax purposes.', 'urls': ['https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#impact-on-completion-of-corporate-income-tax-returns', 'https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#faqs', 'https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#change-in-financial-year-end', 'https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#singapore-financial-reporting-standard-for-small-entities', 'https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#basic-formats-of-tax-computations', 'https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#determining-your-company-s-functional-currency', 'https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#impact-on-preparation-of-tax-computations', 'https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#AverageRate', 'https://www.iras.gov.sg/taxes/corporate-income-tax/form-c-s-form-c-s-(lite)-form-c-filing/#translation-of-specific-items-in-the-tax-computation']}",
        "pdfs": [],
        "tags": [
            "Corporate Income Tax Filing Obligations",
            "Individual Income Tax Compliance",
            "Foreign Employee",
            "Individual Income Tax Bill, Payment, and Refund",
            "Filing responsibilities of self-employed persons"
        ],
        "_id": "67d16b3aaf834a8f0c318c8e",
        "summary": "The article provides guidance on preparing tax computations in Singapore for the Years of Assessment (YA) 2024 and 2025. Key points include:\n\n- **Official Websites**: Ensure to use official Singapore government websites ending in .gov.sg and secured with HTTPS for accurate information.\n- **Currency Requirement**: Tax computations must be prepared in Singapore dollars (S$), regardless of the currency used in financial statements.\n- **Adjustments for Chargeable Income**: Necessary adjustments include accounting for non-deductible expenses and non-taxable receipts to determine chargeable income.\n- **Financial Year-End Changes**: The article discusses how changes in financial year ends can affect tax computations.\n- **Resources**: Links to tax calculators and basic computation formats for various industries are provided.\n- **Currency Translation**: For companies using non-S$ functional currencies, it explains how to translate amounts and calculate the average exchange rate for tax purposes. \n\nThis summary encapsulates the essential tax preparation information relevant for companies operating in Singapore.",
        "embedding_reference": "article_4.json"
    },
    {
        "title": "Budget 2025: Tax Changes and Enterprise Disbursements",
        "url": "https://www.iras.gov.sg/news-events/singapore-budget/budget-2025--tax-changes-and-enterprise-disbursements",
        "text": "{'content': 'Prime Minister and Minister for Finance, Mr. Lawrence Wong, delivered the Budget Statement for the Financial Year 2025. Please visit the Singapore Budget website for the complete Budget Speech package. You may refer to MOF’s Annexes for more details on tax changes and enterprise disbursements, including support for businesses, enhancements to support schemes for internationalisation and mergers and acquisitions, tax incentives recommended by the Equities Market Review Group, the Matched MediSave Scheme, measures in support of SG60, and tax changes.', 'urls': ['https://www.mof.gov.sg/singaporebudget', 'https://www.mof.gov.sg/singaporebudget/budget-speech', 'https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexb2.pdf', 'https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexc1.pdf', 'https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexc2.pdf', 'https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexf2.pdf', 'https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexg1.pdf', 'https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexh2.pdf']}",
        "pdfs": [
            {
                "pdf_title": "annexb2",
                "pdf_url": "https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexb2.pdf",
                "processed_text": "ANNEX B-2: SUPPORT FOR BUSINESSES\n\nTo help manage business costs, the Government will introduce the following:\n\n(A) Corporate Income Tax (“CIT”) Rebate and Cash Grant; and \n(B) Enhancements to the Progressive Wage Credit Scheme (“PWCS”).\n\n(A) Corporate Income Tax Rebate and Cash Grant\n\nTo provide support for companies’ cash flow needs, a CIT Rebate of 50% tax payable will be granted in Year of Assessment (“YA”) 2025.\n\nCompanies that are active and have employed at least one local employee in Calendar Year (“CY”) 2024 (referred to as the “local employee condition”) will receive a minimum benefit of $2,000 in the form of a CIT Rebate Cash Grant.\n\nThe total maximum benefits (i.e., sum of CIT Rebate and CIT Rebate Cash Grant) that a company may receive is $40,000. Eligible companies will automatically receive the benefits from 2Q CY 2025 onwards.\n\nA company is considered to have met the local employee condition if it has made CPF contributions to at least one local (i.e., Singapore Citizen or Permanent Resident) employee, excluding shareholders who are also directors of the company, in CY 2024.\n\nFor example, Company A hired two local employees in CY 2024. It has a tax payable of $30,000 for YA 2025. Company A will receive a $2,000 CIT Rebate Cash Grant and another $13,000 [(50% * $30,000) - $2,000] in CIT Rebate.\n\nMore details can be found on the IRAS website.\n\n(B) Progressive Wage Credit Scheme\n\nThe PWCS was introduced at Budget 2022 to provide transitional wage support for employers to adjust to the Progressive Wages moves from CY 2022 to CY 2026, as well as encourage employers to raise wages of lower-wage workers.\n\nThe following conditions apply:\n\na. Employee has average gross monthly wages of up to $3,000, before the wage increase;  \nb. Employee has average gross monthly wages of up to $4,000, after the wage increase;  \nc. Average gross monthly wage increase must be at least $100 in each qualifying year; \n\nand \n\nd. Wage increase in each qualifying year will be co-funded for two years if the wage increase is sustained.\n\nTo strengthen support for employers to uplift the wages of lower-wage employees, the PWCS co-funding support will be enhanced for wage increases given in the qualifying years 2025 and 2026. Refer to Table 1 for more details.\n\nTable 1: Increase in PWCS Co-Funding Levels for Eligible Wage Increases from 2025 to 2026\n\nPayout Period\n\nCurrent\n\nNew\n\nQualifying Year (i.e., year that wage increase was given) \n2025\n\n1Q 2026\n\n2026\n\n1Q 2027\n\n30%\n\n15%\n\n40% (+10%-pt) \n20% (+5%-pt)\n\nMore Information\n\nScheme\n\nCorporate Income Tax Rebate and Cash Grant\n\nProgressive Wage Credit Scheme\n\nContact Details\n\nPlease contact IRAS at ctmail@iras.gov.sg.\n\nPlease visit the PWCS website at https://go.gov.sg/PWCS.",
                "pdf_tags": [
                    "Corporate Income Tax Rate, Rebates & Tax Exemption Schemes",
                    "Personal tax relief",
                    "Personal Tax rebate",
                    "Corporate Income Tax Filing Obligations",
                    "Claiming Reliefs for Foreign Tax Credit, Group Relief, and Loss Carry-back Relief"
                ],
                "pdf_summary": "**Summary of Annex B-2: Support for Businesses**\n\nThe government is introducing measures to support businesses, including a Corporate Income Tax (CIT) Rebate and Cash Grant, as well as enhancements to the Progressive Wage Credit Scheme (PWCS).\n\n**A. Corporate Income Tax Rebate and Cash Grant**\n- A CIT Rebate of 50% of tax payable will be available for Year of Assessment (YA) 2025.\n- Companies must employ at least one local employee in Calendar Year (CY) 2024 to qualify, which requires making CPF contributions for a local employee (Singapore Citizen or Permanent Resident), excluding shareholders who are also directors.\n- Eligible companies will receive a minimum benefit of $2,000 as a CIT Rebate Cash Grant.\n- The total maximum benefit (CIT Rebate + Cash Grant) is capped at $40,000.\n- Benefits will be automatically provided from the second quarter of CY 2025.\n\n**Example:** If a company has a tax payable of $30,000, it will receive a $2,000 Cash Grant and a $13,000 CIT Rebate (50% of $30,000 minus the Cash Grant).\n\n**B. Progressive Wage Credit Scheme (PWCS)**\n- The PWCS, introduced in Budget 2022, supports wage increases for lower-wage workers.\n- Conditions for eligibility include:\n  - Average gross monthly wages of up to $3,000 before the increase.\n  - Average gross monthly wages of up to $4,000 after the increase.\n  - A minimum wage increase of $100 each qualifying year.\n  - Co-funding for wage increases sustained over two years.\n- The co-funding support for wage increases in qualifying years 2025 and 2026 will be enhanced:\n  - For 2025, co-funding increases from 30% to 40%.\n  - For 2026, co-funding increases from 15% to 20%.\n\nFor more information, businesses can contact IRAS at ctmail@iras.gov.sg or visit the PWCS website.",
                "pdf_embedding_reference": "article_5_pdf_0.json"
            },
            {
                "pdf_title": "annexc1",
                "pdf_url": "https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexc1.pdf",
                "processed_text": "ANNEX C-1: ENHANCEMENTS TO SUPPORT SCHEMES FOR INTERNATIONALISATION AND MERGERS AND ACQUISITIONS\n\n(A) Extend the Enhanced Cap for the Market Readiness Assistance Grant\n\nThe Market Readiness Assistance (MRA) grant helps companies to expand into new markets overseas by defraying the costs of overseas market promotion, business development, and market set-up.\n\nThe enhanced grant cap of $100,000 per new market is scheduled to lapse after 31 March 2025. To continue supporting local SMEs in expanding into new markets overseas, the enhanced cap will be extended till 31 March 2026.\n\n(B) Extend the Double Tax Deduction for Internationalisation Scheme\n\nThe Double Tax Deduction for Internationalisation (DTDi) scheme allows businesses to claim a tax deduction of 200% on qualifying market expansion and investment development expenses.\n\nThe scheme is scheduled to lapse after 31 December 2025. To continue supporting businesses in their internationalisation efforts, the DTDi scheme will be extended till 31 December 2030.\n\n(C) Enhance the Enterprise Financing Scheme\n\nThe Enterprise Financing Scheme (EFS) enables Singapore enterprises to access financing more readily across all stages of growth. There will be two enhancements to the EFS.\n\nFirst, the maximum loan quantum under the EFS – Trade Loan will be permanently enhanced from $5 million to $10 million. This will help businesses to meet their increased trade financing needs, especially amid elevated costs, and support their internationalisation efforts.\n\nSecond, the scope of the EFS – Mergers and Acquisitions Loan will be enhanced beyond equity acquisitions to support targeted asset acquisitions from 1 April 2025 till 31 March 2030. This will provide more flexible and holistic financing support for Singapore enterprises pursuing inorganic growth opportunities.\n\n(D) Extend the Mergers and Acquisitions Scheme\n\nThe Mergers and Acquisitions (M&A) scheme allows a Singapore company that makes a qualifying acquisition of the ordinary shares of another company to claim the following tax benefits (subject to conditions):\n\na. An M&A allowance (to be written down over five years) that is based on 25% of up to $40 million of the value of all qualifying acquisitions per Year of Assessment (YA) (i.e., $10 million); and\n\nb. 200% tax deduction on transaction costs incurred on qualifying acquisitions, subject to an expenditure cap of $100,000 per YA.\n\nThe scheme is scheduled to lapse after 31 December 2025. To continue supporting companies to grow through M&A, the scheme will be extended till 31 December 2030.\n\nMore Information\n\nScheme\n\nMarket Readiness Assistance Grant\n\nContact Details\n\nPlease contact EnterpriseSG at +65 6898 1800 or write to EnterpriseSG through their enquiry and feedback form.\n\nDouble Tax Deduction for internationalisation Scheme\n\nPlease contact EnterpriseSG at +65 6898 1800 or write to EnterpriseSG through their enquiry and feedback form.\n\nEnterprise Financing Scheme\n\nPlease contact the respective Participating Financial Institutions (PFIs) if more information is required.\n\nMergers and Acquisitions Scheme\n\nPlease contact IRAS’ Corporate Income Tax Helpline at 1800 356 8622.",
                "pdf_tags": [
                    "Corporate Income Tax Rate, Rebates & Tax Exemption Schemes",
                    "Personal tax relief",
                    "Personal Tax rebate",
                    "Corporate Income Tax Filing Obligations",
                    "Claiming Reliefs for Foreign Tax Credit, Group Relief, and Loss Carry-back Relief"
                ],
                "pdf_summary": "**Summary of Tax Enhancements for Internationalisation and Mergers & Acquisitions**\n\n1. **Market Readiness Assistance Grant (MRA)**:\n   - The enhanced grant cap of $100,000 per new market for the MRA will be extended until **31 March 2026**. This grant supports local SMEs in expanding into overseas markets by covering costs related to market promotion, business development, and market set-up.\n\n2. **Double Tax Deduction for Internationalisation (DTDi)**:\n   - The DTDi scheme, which allows businesses to claim a **200% tax deduction** on qualifying market expansion and investment development expenses, will be extended until **31 December 2030**. The current expiration date was **31 December 2025**.\n\n3. **Enterprise Financing Scheme (EFS)**:\n   - **Trade Loan**: The maximum loan quantum will increase from **$5 million to $10 million** permanently, aiding businesses in meeting trade financing needs.\n   - **Mergers and Acquisitions Loan**: The scope will expand to include targeted asset acquisitions from **1 April 2025 to 31 March 2030**, providing more flexible financing for enterprises pursuing growth through acquisitions.\n\n4. **Mergers and Acquisitions (M&A) Scheme**:\n   - The M&A scheme allows qualifying companies to claim:\n     - An M&A allowance of **25%** on up to **$40 million** of qualifying acquisitions per Year of Assessment (YA), equating to a maximum of **$10 million**.\n     - A **200% tax deduction** on transaction costs related to qualifying acquisitions, capped at **$100,000** per YA.\n   - This scheme will also be extended until **31 December 2030**, previously set to lapse on **31 December 2025**.\n\n**Contact Information**:\n- For inquiries regarding the MRA and DTDi, contact **EnterpriseSG** at **+65 6898 1800**.\n- For the EFS, reach out to the respective Participating Financial Institutions.\n- For the M&A scheme, contact the **IRAS Corporate Income Tax Helpline** at **1800 356 8622**.",
                "pdf_embedding_reference": "article_5_pdf_1.json"
            },
            {
                "pdf_title": "annexc2",
                "pdf_url": "https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexc2.pdf",
                "processed_text": "The Equities Market Review Group was established in August 2024 to recommend measures to strengthen equities market development in Singapore. Chaired by Mr. Chee Hong Tat, Minister for Transport, Second Minister for Finance, and Deputy Chairman of MAS, the group includes key private sector stakeholders and public sector representatives.\n\nThe Review Group has made tax-related recommendations to the Government to encourage new listings in Singapore and increase investment demand for Singapore-listed equities. The Government has accepted these recommendations and will introduce three tax incentives:\n\n(A) Listing Corporate Income Tax (CIT) Rebate for new corporate listings in Singapore;  \n(B) Enhanced concessionary tax rate (CTR) for new fund manager listings in Singapore;  \n(C) Tax exemption on fund managers’ qualifying income arising from funds investing substantially in Singapore-listed equities.\n\n(B) and (C) are enhancements to the Financial Sector Incentive – Fund Management (FSI-FM), which currently awards a CTR of 10% on qualifying income derived by fund managers in Singapore from the provision of fund management and investment advisory services.\n\nThe Review Group will provide more details on its recommendations after Budget 2025.\n\n(A) Listing Corporate Income Tax Rebate for New Corporate Listings in Singapore\n\nTo encourage companies to raise public capital and grow their economic activities in Singapore, qualifying entities may apply for a 10% or 20% Listing CIT Rebate. \n\nQualifying entities include companies and registered business trusts that are tax residents in Singapore. The tax benefits are as follows: primary listings receive a 20% CIT rebate, while secondary listings (with share issuance) receive a 10% CIT rebate. There is a rebate cap of $6 million per Year of Assessment (YA) for qualifying entities with a market capitalization of at least $1 billion, and $3 million per YA for those with a market capitalization of less than $1 billion.\n\nTo qualify, entities must achieve a primary or secondary listing on a Singapore exchange and remain listed for 5 years. They must also commit to incremental local business spending or fixed asset investments, and incremental skilled employment by the end of the award tenure. The scheme duration is 5 years per qualifying entity and is non-renewable. It is open for award until 31 December 2027. Interested entities can approach EDB or EnterpriseSG for more details.\n\n(B) Enhanced CTR for New Fund Manager Listings in Singapore\n\nTo enhance Singapore’s value proposition to fund managers seeking to scale up their activities via public fundraising and grow their investment activities in Singapore, an enhanced CTR tier of 5% will be introduced under the FSI-FM for newly listed fund managers.\n\nQualifying entities are Singapore fund managers, who will receive a 5% CTR on qualifying income. To qualify, the fund manager or its holding company must achieve a primary listing on a Singapore exchange and remain listed for 5 years. The fund manager must distribute a portion of its profits as dividends and meet minimum requirements for professional headcount and assets under management (AUM). The award tenure is 5 years per fund manager and is non-renewable. It is open for award until 31 December 2028. Interested fund managers can approach MAS for more details.\n\n(C) Tax Exemption on Fund Managers’ Qualifying Income Arising from Funds Investing Substantially in Singapore-Listed Equities\n\nTo support fund managers in launching and managing qualifying funds that invest substantially in Singapore-listed equities, a corporate tax exemption on income arising from such funds will be introduced under the FSI-FM.\n\nQualifying entities are Singapore fund managers who will receive a tax exemption on qualifying income. Fund managers must meet minimum professional headcount and AUM requirements. Qualifying funds must meet the following criteria: for new funds, at least 30% of AUM must be invested in Singapore-listed equities; for existing funds, at least 30% of AUM must be invested in Singapore-listed equities, and annual net subscriptions (i.e., subscriptions less redemptions) must be equivalent to at least 5% of the fund’s AUM in the preceding year.\n\nThe qualifying income includes fees earned from fund management and investment advisory activities related to the qualifying funds. The award tenure is 5 years per fund managed by the fund manager and is non-renewable. It is open for award until 31 December 2028. Interested fund managers can approach MAS for more details.\n\nFor more information, please contact EnterpriseSG at +65 6898 1800 or through their enquiry and feedback form, or EDB at client_services@edb.gov.sg. For MAS, please contact helpdesk@mas.gov.sg.",
                "pdf_tags": [
                    "Corporate Income Tax Rate, Rebates & Tax Exemption Schemes",
                    "Personal tax relief",
                    "Personal Tax rebate",
                    "Corporate Income Tax Filing Obligations",
                    "Claiming Reliefs for Foreign Tax Credit, Group Relief, and Loss Carry-back Relief"
                ],
                "pdf_summary": "The Equities Market Review Group, established in August 2024 and chaired by Mr. Chee Hong Tat, has made several tax-related recommendations to enhance the equities market in Singapore. The Government has accepted these recommendations and will introduce three key tax incentives aimed at encouraging new listings and increasing investment in Singapore-listed equities:\n\n1. **Listing Corporate Income Tax (CIT) Rebate**: \n   - Qualifying entities (companies and registered business trusts that are tax residents in Singapore) can apply for a 10% or 20% CIT rebate based on their listing type.\n   - Primary listings receive a 20% rebate, while secondary listings receive a 10% rebate.\n   - There is a cap of $6 million per Year of Assessment (YA) for entities with a market capitalization of at least $1 billion, and $3 million per YA for those with less than $1 billion.\n   - Entities must remain listed for 5 years and commit to local business spending and skilled employment.\n   - The scheme is open until December 31, 2027.\n\n2. **Enhanced Concessionary Tax Rate (CTR) for New Fund Manager Listings**: \n   - Newly listed Singapore fund managers can benefit from an enhanced CTR of 5% on qualifying income.\n   - To qualify, fund managers must achieve a primary listing and remain listed for 5 years, distribute profits as dividends, and meet minimum professional headcount and assets under management (AUM) requirements.\n   - This incentive is available until December 31, 2028.\n\n3. **Tax Exemption on Fund Managers’ Qualifying Income**: \n   - Fund managers managing qualifying funds that invest substantially in Singapore-listed equities will receive a corporate tax exemption on qualifying income.\n   - New funds must invest at least 30% of AUM in Singapore-listed equities, while existing funds must also meet this requirement and have annual net subscriptions of at least 5% of AUM.\n   - The exemption applies to fees from fund management and investment advisory activities related to these funds.\n   - This incentive is available until December 31, 2028.\n\nFor further details, interested parties can contact EnterpriseSG or the Monetary Authority of Singapore (MAS).",
                "pdf_embedding_reference": "article_5_pdf_2.json"
            },
            {
                "pdf_title": "annexf2",
                "pdf_url": "https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexf2.pdf",
                "processed_text": "The Government will introduce a five-year Matched MediSave Scheme (MMSS) from January 2026, to boost MediSave adequacy for seniors with lower balances.\n\nUnder the MMSS, the Government will match every dollar of voluntary cash top-ups to the MediSave Account (MA) of eligible CPF members, up to an annual cap of $1,000. Anyone, including their families, employers, and the community, can make the top-ups to eligible members’ CPF MA. Givers will not receive income tax relief (CPF Cash Top-Up Relief) for cash top-ups that attract the MMSS matching grant.\n\nTo be eligible for the MMSS, the CPF member whose CPF MA is being topped up must:\n\na. Be a Singapore Citizen aged 55 to 70;  \nb. Own no more than one property;  \nc. Have a residential Annual Value of not more than $21,000;  \nd. Have an average monthly income of not more than $4,000; and  \ne. Have a CPF MA balance that is less than half the prevailing Basic Healthcare Sum.\n\nMMSS eligibility is automatically assessed every year, and the CPF Board will notify eligible members at the beginning of each year, from January 2026. Members can also check their eligibility via the CPF website from January 2026. About 184,000 CPF members are expected to be eligible for the MMSS. Matching grants by the Government will be disbursed to eligible members in the following year.\n\nMore Information\n\nScheme\n\nMatched MediSave Scheme\n\nContact Details\n\nPlease contact the CPF Board at cpf.gov.sg/contact-us.\n\nGivers may continue to enjoy income tax relief of up to $8,000 per year for eligible cash top-ups to their own CPF Special Account, Retirement Account, or MA, and another $8,000 per year for eligible cash top-ups to the accounts of their loved ones, that do not attract any matching grant under the MMSS or the Matched Retirement Savings Scheme. For more details, please refer to Annex H-2.",
                "pdf_tags": [
                    "Corporate Income Tax Rate, Rebates & Tax Exemption Schemes",
                    "Personal tax relief",
                    "Personal Tax rebate",
                    "Corporate Income Tax Filing Obligations",
                    "Claiming Reliefs for Foreign Tax Credit, Group Relief, and Loss Carry-back Relief"
                ],
                "pdf_summary": "The Matched MediSave Scheme (MMSS) will be introduced by the Government in January 2026 to enhance MediSave adequacy for seniors with lower balances. Key features of the MMSS include:\n\n- The Government will match every dollar of voluntary cash top-ups to eligible CPF members' MediSave Accounts (MA) up to an annual cap of $1,000.\n- Anyone can make these top-ups, but givers will not receive income tax relief for contributions that qualify for the MMSS matching grant.\n  \nEligibility criteria for the MMSS include:\n1. Must be a Singapore Citizen aged 55 to 70.\n2. Must own no more than one property.\n3. Residential Annual Value must not exceed $21,000.\n4. Average monthly income must not exceed $4,000.\n5. CPF MA balance must be less than half of the prevailing Basic Healthcare Sum.\n\nEligibility will be assessed automatically each year, with notifications sent out by the CPF Board starting January 2026. Approximately 184,000 CPF members are expected to qualify for the scheme.\n\nAdditionally, givers can still claim income tax relief of up to $8,000 per year for eligible cash top-ups to their own CPF Special Account, Retirement Account, or MA, and another $8,000 for top-ups to loved ones' accounts that do not qualify for MMSS matching grants. For further details, refer to the CPF Board’s website.",
                "pdf_embedding_reference": "article_5_pdf_3.json"
            },
            {
                "pdf_title": "annexg1",
                "pdf_url": "https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexg1.pdf",
                "processed_text": "The Government will introduce several measures during the milestone year of Singapore’s 60th anniversary. These include:\n\n(A) SG60 Package;  \n(B) SG60 Rental Support for Hawker Centre and Market Stallholders;  \n(C) SG Culture Pass;  \n(D) SG60 ActiveSG Credit Top-Up;  \n(E) Measures to encourage philanthropy; and  \n(F) Additional Grants to Self-Help Groups (“SHGs”).  \n\nThis Annex also provides some examples of private sector support for SG60.\n\n(A) SG60 Package\n\nTo recognise the contributions of all Singaporeans and to share the benefits of our nation’s progress, the Government will introduce an SG60 package. Components of the SG60 package are summarised in Table 1, with further details below.\n\nTable 1: SG60 Package\n\nSummary of Measure\n\nOne-time SG60 Vouchers for all Singapore Citizen adults aged 21 years and above in 2025.  \nPersonal Income Tax Rebate of 60% of tax payable for all tax resident individuals for the Year of Assessment 2025, capped at $200 per taxpayer.  \nAn SG60 Baby Gift for all SC babies born in 2025.\n\nMeasure\n\nSG60 Vouchers  \nPersonal Income Tax Rebate  \nSG60 Baby Gift  \n\nSG60 Vouchers\n\nAll Singapore Citizens (“SC”) aged 21 and above in 2025 will receive $600 in SG60 Vouchers. SC seniors aged 60 and above in 2025 will receive $200 more – a total of $800 in SG60 Vouchers. Refer to Table 2 for more details.\n\nTable 2: SG60 Vouchers Quantum\n\nYear of Birth  \nSG60 Voucher Quantum  \n\n1965 or earlier (i.e., aged 60 and above in 2025)  \n1966 – 2004 (i.e., aged 21 to 59 in 2025)  \n\n$800  \n$600  \n\nThe SG60 Vouchers will be disbursed across the month of July. SC seniors will be able to claim the vouchers first, followed by all other SC adults. The SG60 Vouchers will expire on 31 December 2026.\n\nIn terms of claiming and spending, the SG60 Vouchers will have the same user experience as the Community Development Council (“CDC”) Vouchers:\n\n• Claim: The SG60 Vouchers can be claimed digitally on RedeemSG via Singpass. SCs who are unable to claim their vouchers digitally can approach their nearest Community Centres/Clubs for assistance to claim the vouchers.\n\n• Spend: The SG60 Vouchers can be used at all businesses that accept the CDC Vouchers. Half of the SG60 Vouchers will be allocated for spending at participating heartland merchants and hawkers, while the other half will be allocated for spending at participating supermarkets.\n\nThe SG60 Vouchers will benefit about three million SC adults. More details will be released subsequently by the People’s Association and the CDCs.\n\nPersonal Income Tax Rebate\n\nThe Government will provide a Personal Income Tax (“PIT”) Rebate of 60% of tax payable for all tax resident individuals for the Year of Assessment (“YA”) 2025 (i.e., for income earned in 2024).\n\nThe rebate will be capped at $200 per taxpayer. The $200 cap ensures that the PIT Rebate mostly benefits middle-income workers.\n\nNo application for the PIT Rebate is required. IRAS will compute and grant the rebate automatically to all tax resident individuals.\n\nFor more information on your PIT Rebate, you may refer to your tax bill for YA 2025. Most taxpayers should receive their tax bills between April to September 2025.\n\nSG60 Baby Gift\n\nTo celebrate the joy and significance of parenthood, the Government will provide an SG60 Baby Gift for all SC babies born in 2025.\n\nMore details will be provided at the Prime Minister’s Office’s Committee of Supply.\n\n(B) SG60 Rental Support for Hawker Centre and Market Stallholders\n\nTo mark the fifth anniversary of the inscription of Hawker Culture onto the UNESCO Representative List of Intangible Cultural Heritage of Humanity, the Government will provide a one-time SG60 Rental Support to recognise the important role that hawker centres and markets play in our national identity and heritage.\n\nThe one-time $600 rental support will be extended to each stall in hawker centres and markets managed by Government and Government-appointed operators to appreciate their contributions.\n\nDetails will be released to stallholders by the relevant agencies.\n\n(C) SG Culture Pass\n\nThe SG Culture Pass aims to foster national pride and identity amongst Singaporeans through local arts and heritage.\n\nAll SCs aged 18 years old and above in 2025 will be eligible for $100 SG Culture Pass credits. The SG Culture Pass credits will be valid from 1 September 2025 to 31 December 2028.\n\nThe credits can be used to purchase tickets for eligible local performances, exhibitions, and experiences such as learning tours and participatory workshops, and sold by approved ticketing partners.\n\nMore details on how to claim the SG Culture Pass credits will be released subsequently by MCCY.\n\n(D) SG60 ActiveSG Credit Top-Up\n\nThe SG60 ActiveSG Credit Top-Up aims to encourage broad-based sports participation across different segments of society during SG60.\n\nSCs and Permanent Residents will be eligible for a one-off $100 SG60 ActiveSG Credit Top-Up in June 2025.\n\n• Existing ActiveSG members will receive the $100 SG60 ActiveSG Credit Top-Up.\n\n• New ActiveSG members will receive $200 credits – $100 credits from the existing new member incentive scheme implemented in 2014 and the $100 SG60 ActiveSG Credit Top-Up.\n\nThe credits can be used for fees for ActiveSG facilities and to offset fees for ActiveSG programmes.\n\nMore details will be released at MCCY’s Committee of Supply.\n\n(E) Measures to Encourage Philanthropy\n\nThe Government and Tote Board will set aside more than $600 million in matching funds to strengthen our spirit of giving.\n\nTop-up to the Cultural Matching Fund\n\nThe Cultural Matching Fund (“CMF”) aims to encourage broad-based cultural philanthropy through the provision of dollar-for-dollar matching for cash donations to eligible arts and heritage charities.\n\nTo encourage continued giving to the arts and heritage sector, the Government will provide a $100 million top-up to the CMF and extend it for five years till end-FY 2029.\n\nTote Board’s Enhanced Fund-Raising Programme\n\nSince FY 2020, the Government and Tote Board has provided dollar-for-dollar matching support, capped at $250,000 per year per charity for eligible fund-raisers for local charitable causes. This dollar-for-dollar matching support was intended to provide exceptional support for charities during Covid-19.\n\nTo provide our charities continued support, especially during SG60, the Government and Tote Board will provide a $270 million top-up and extend the Enhanced Fund-Raising (“EFR”) Programme for three years until end-FY 2027.\n\nSpecifically, we will maintain the existing dollar-for-dollar matching support levels in FY 2025, halve the support level in FY 2026, and return to pre-Covid-19 levels in FY 2027. Refer to Table 3 for more details. Such an approach will provide charities sufficient time to adjust their fund-raising plans.\n\nTable 3: The Government’s and Tote Board’s Matching Support for the EFR Programme from FY 2006 to FY 2027\n\nEFR Matching Support\n\nFY 2006 to FY 2019\n\nFY 2020 to FY 2024\n\nFY 2025\n\nFY 2026\n\nFY 2027\n\nTote Board\n\n20% of funds raised, to up $50,000 per application.  \n\nGovernment Nil.  \n\n40% of funds raised, up to $100,000 per application and up to five applications per charity per FY.  \n60% of funds raised, up to $150,000 per charity per FY.  \n\n40% of funds raised, up to $100,000 per application and up to five applications per charity per FY.  \n60% of funds raised, up to $150,000 per charity per FY.  \n\n20% of funds raised, up to $50,000 per application and up to five applications per charity per FY.  \n30% of funds raised, up to $75,000 per charity per FY.  \nNil.  \n\nCommitted Budget (from FY 2025 to FY 2027)\n\n$170 million  \n\n$100 million  \n\nNotes:  \nIn celebration of Tote Board’s 30th anniversary in FY 2018, there was a one-off matching at 40% of funds raised, up to $100,000 per application.  \nFive applications per charity cap introduced from FY 2021 onwards.  \n\nCharities can also leverage broad-based support schemes by the Government, such as 250% tax deductions for qualifying donations to Institutions of a Public Character, as well as the Charities Capabilities Fund which provides funding support to enhance the governance and management capabilities of charities.\n\nSG Gives Matching Grant\n\nThe SG Gives matching grant will be introduced to galvanise Singaporeans to contribute to social and community programmes, aligning with the SG60 theme of “Building Our Singapore Together” which rallies Singaporeans to contribute to the next chapter of nation building and commit to building a shared future together.\n\nThrough the SG Gives matching grant, donations made to eligible social and community programmes through the Community Chest (ComChest), President’s Challenge, and the Collective for a Stronger Society, will be matched by the Government up to $250 million. For every dollar donation made in 2025, it will be matched with an equivalent dollar. To encourage sustained giving, donations of $250,000 or more per year over three years will be matched with $1.50 for every dollar. Refer to Tables 4 and 5 for more details.\n\nProgrammes that will benefit from matching grant include KidSTART, ComLink+, New Life Stories’ Family Strengthening Programme, and 3Pumpkins’ Tak Takut Kids Club.\n\nTable 4: Parameters of General and Enhanced Matching\n\nMatching ratio  \nEligibility period  \n\nGeneral matching  \n$1 Government matching for every dollar donated  \n1 January 2025 to 31 December 2025  \n\nRequirements  \n\nNo minimum donation amount or commitment period  \n\nEnhanced matching  \nUp to $1.50 Government matching for every dollar donated  \n1 January 2025 to 31 December 2027  \nDonations of at least $250,000 each year, for a three-year commitment period  \n\nTable 5: Illustration of General and Enhanced Matching\n\nCorresponding Matching Grant  \n\nDonation  \n\n2025  \n\n2026  \n\n2027  \n\nEligibility  \n\nTotal matching  \n\nTotal funds  \n\nDonor A  \n\nDonor B  \n\n$250,000  \n\n$0  \n\n$0  \n\n$250,000  \n\n$250,000  \n\n$250,000  \n\nEligible for 1:1 matching for donation made in 2025  \nEligible for 1.5:1 matching for donations made in 2025-2027  \n\n$250,000  \n\n$500,000  \n\n$1,125,000  \n\n$1,875,000  \n\n(F) Additional Grants to Self-Help Groups\n\nThe Government will provide additional grants of $60 million over five years to SHGs to enhance their programming and enable them to better support their communities. The SHGs refer to the Chinese Development Assistance Council, Yayasan MENDAKI, the Singapore Indian Development Association, and the Eurasian Association.\n\nTogether with the support announced at Budget 2022 and Budget 2023, the SHGs will receive $18 million in FY 2025 and $12 million a year from FY 2026 to FY 2029.\n\n(G) Other Support for SG60\n\nAs of the date of the Budget Statement, the following coffee shop and supermarket operators listed in Table 6 have committed to providing promotions to celebrate SG60.\n\nTable 6: List of companies that have committed to providing promotions to celebrate SG60\n\n1. Badaling Holdings Pte Ltd (at FoodHub locations)  \n2. Broadway Food Centre (Holdings) Pte Ltd  \n3. Chang Cheng Holdings  \n4. Koufu Group  \n5. NTUC FairPrice Group  \n6. Sheng Siong Group Ltd  \n\nWe encourage all segments of Singapore society to step forward and celebrate SG60 in their own way.\n\nMore Information\n\nScheme  \n\nWebsite or Contact Details  \n\nSG60 Personal Income Tax Rebate  \n\nSG Culture Pass  \nSG60 ActiveSG Credit Top-Up  \n\nCultural Matching Fund  \n\nEnhanced Fund-Raising Programme  \n\nSG Gives Matching Grant  \n\nPlease visit https://www.iras.gov.sg/taxes/individual-income-tax/basics-of-individual-income-tax/tax-reliefs-rebates-and-deductions/tax-reliefs/personal-income-tax-rebate.  \nPlease contact CP_enquiries@mccy.gov.sg.  \nPlease visit https://www.activesgcircle.gov.sg.  \nPlease visit https://www.mccy.gov.sg/sector/policies/cultural-matching-fund.  \nPlease visit https://www.toteboard.gov.sg/grants/fund-raising-programme.  \nDonors can visit www.giving.sg/SG60SHARE.  \nFor multi-year donations, donors can contact ComChest at shay_chua@ncss.gov.sg.  \nDonations to President’s Challenge can be made at www.presidentschallenge.gov.sg/take-action/donate.  \nDonations to the Collective for a Stronger Society can be made at https://go.gov.sg/strongersocietyfund.  \nFor multi-year donations, donors can contact the Community Foundation of Singapore (CFS) at css@cf.org.sg.  ",
                "pdf_tags": [
                    "Corporate Income Tax Rate, Rebates & Tax Exemption Schemes",
                    "Personal tax relief",
                    "Personal Tax rebate",
                    "Corporate Income Tax Filing Obligations",
                    "Claiming Reliefs for Foreign Tax Credit, Group Relief, and Loss Carry-back Relief"
                ],
                "pdf_summary": "The article outlines various tax-related measures introduced by the Singapore Government in celebration of the nation's 60th anniversary (SG60). Key components include:\n\n1. **SG60 Package**:\n   - **SG60 Vouchers**: Singapore Citizens (SC) aged 21 and above will receive $600 in vouchers, with seniors (aged 60 and above) receiving $800. Vouchers can be claimed digitally and will expire on December 31, 2026.\n   - **Personal Income Tax (PIT) Rebate**: A 60% rebate on tax payable for tax resident individuals for the Year of Assessment (YA) 2025, capped at $200 per taxpayer. No application is needed; the rebate will be automatically computed by the Inland Revenue Authority of Singapore (IRAS).\n   - **SG60 Baby Gift**: A gift for all SC babies born in 2025.\n\n2. **SG60 Rental Support**: A one-time rental support of $600 for each stall in government-managed hawker centres and markets.\n\n3. **SG Culture Pass**: SCs aged 18 and above will receive $100 in credits for local arts and heritage activities, valid from September 1, 2025, to December 31, 2028.\n\n4. **SG60 ActiveSG Credit Top-Up**: A one-off $100 credit for existing ActiveSG members and $200 for new members, usable for fees associated with ActiveSG facilities and programs.\n\n5. **Philanthropy Encouragement Measures**:\n   - **Cultural Matching Fund**: A $100 million top-up to encourage donations to arts and heritage charities.\n   - **Enhanced Fund-Raising Programme**: A $270 million top-up to support charities, with varying matching support levels until FY 2027.\n   - **SG Gives Matching Grant**: Government matching for donations to eligible social programs, with a general matching of $1 for every dollar donated in 2025, and enhanced matching for larger commitments.\n\n6. **Additional Grants to Self-Help Groups (SHGs)**: $60 million over five years to support SHGs, including the Chinese Development Assistance Council and others.\n\nFor more detailed information on these measures, individuals can refer to the respective government websites and contact points provided in the article.",
                "pdf_embedding_reference": "article_5_pdf_4.json"
            },
            {
                "pdf_title": "annexh2",
                "pdf_url": "https://www.mof.gov.sg/docs/librariesprovider3/budget2025/download/pdf/annexh2.pdf",
                "processed_text": "ANNEX H-2: TAX CHANGES\n\nS/N\n\nName of Tax Change\n\nExisting Tax Treatment\n\nNew Tax Treatment\n\nSupporting Companies and Individuals\n\nN/A\n\n1. Provide 50% Corporate Income Tax (“CIT”) Rebate in Year of Assessment (“YA”) 2025 with a minimum benefit of $2,000 for eligible companies\n\nMINISTRY OF FINANCE\n\nTo provide support for companies’ cash flow needs, a CIT Rebate of 50% of tax payable will be granted in YA 2025. Companies that are active and have employed at least one local employee in Calendar Year (“CY”) 2024 (referred to as the “local employee condition”) will receive a minimum benefit of $2,000 in the form of a CIT Rebate Cash Grant. The total maximum benefits (i.e., sum of CIT Rebate and CIT Rebate Cash Grant) that a company can receive is $40,000. Eligible companies will automatically receive the benefits from 2Q CY 2025 onwards. A company is considered to have met the local employee condition if it has made CPF contributions to at least one local (i.e., Singapore Citizen or Permanent Resident) employee, excluding shareholders who are also directors of the company, in CY 2024. For example, Company A hired two local employees in CY 2024. It has a tax payable of $30,000 for YA 2025. Company A will receive a $2,000 CIT Rebate Cash Grant and another $13,000 [(50% * $30,000) - $2,000] in CIT Rebate.\n\n2. Provide Personal Income Tax (“PIT”) Rebate for YA 2025\n\nN/A\n\nAs part of the SG60 package, a PIT Rebate of 60% of tax payable will be provided to all tax resident individuals for YA 2025. The rebate will be capped at $200 per taxpayer.\n\nMaintaining a Fair and Competitive Tax System\n\n3. Extend the Double Tax Deduction for Internationalisation (“DTDi”) scheme\n\nBusinesses are allowed a tax deduction of 200% on qualifying market expansion and investment development expenses under the DTDi scheme.\n\nTo continue supporting businesses in their internationalisation efforts, the DTDi scheme will be extended till 31 December 2030.\n\n4. Extend the Mergers and Acquisitions (“M&A”) scheme\n\nEnterpriseSG will provide further details by 2Q 2025.\n\nTo continue supporting companies to grow through M&A, the scheme will be extended till 31 December 2030. The scheme is scheduled to lapse after 31 December 2025. The M&A scheme allows a Singapore company that makes a qualifying acquisition of the ordinary shares of another company to claim the following tax benefits, subject to conditions: a) An M&A allowance (to be written down over five years) that is based on 25% of up to $40 million of the value of all qualifying acquisitions per YA (i.e., $10 million); and b) 200% tax deduction on transaction costs incurred on qualifying acquisitions.\n\n5. Enhance Section 13W of the Income Tax Act 1947 (“ITA”) that provides upfront certainty of non-taxation of companies’ disposal gains\n\nsubject to an expenditure cap of $100,000 per YA.\n\nThe scheme is scheduled to lapse after 31 December 2025. Section 13W of the ITA provides that gains derived from the disposal of ordinary shares by companies will not be taxed, if: To provide greater certainty to companies, the sunset date under Section 13W will be removed and the following enhancements will be made: a) The divesting company maintains a minimum level of shareholding of 20% in the investee company for a continuous period of at least 24 months prior to the disposal of any shares in the investee company (“shareholding condition”); and b) Expand the scope of eligible gains to include gains from the disposal of preference shares that are accounted for as equity by the investee company under the applicable accounting principles; and c) Allow the assessment of the shareholding threshold condition to be done on a group basis. b) The shares are disposed during the period from 1 June 2012 to 31 December 2027. These changes will take effect for disposal gains derived on or after 1 January 2026. IRAS will provide further details by 3Q 2025.\n\n6. Introduce a tax deduction on the holding payments to company or a special purpose vehicle (“SPV”) for issuance of new shares of the holding company under employee equity-based remuneration (“EEBR”) schemes\n\nCompanies are allowed tax deduction for treasury shares or previously issued shares of the company or the holding company that are transferred to employees under EEBR schemes.\n\nTo ensure that our tax regime remains relevant and competitive, companies will be allowed to claim a tax deduction on payments to the holding company or a SPV for the issuance of new shares of the holding company under EEBR schemes. No tax deduction is allowed where new shares are issued to employees under EEBR schemes. The deduction will be the lower of: a) The amount paid by the company; and b) The fair market value, or net asset value of the shares (if the fair market value is not readily available), at the time the shares are applied for the benefit of the employee, less any amount payable by employees for the shares. The changes will take effect from YA 2026. IRAS will provide further details by 3Q 2025.\n\n7. Introduce a tax deduction for payments made under an approved cost-sharing agreement (“CSA”) for innovation activities\n\nPayments made under a CSA for innovation activities that do not meet the definition of “research and development” under Section 2 of the ITA are not deductible.\n\nTo support collaborative innovation activities, a 100% tax deduction for payments made by companies under an approved CSA for innovation activities will be introduced with effect from 19 February 2025. EDB will provide further details by 2Q 2025.\n\n8. Extend and enhance the Land Intensification Allowance (“LIA”) scheme\n\nThe LIA scheme grants an approved recipient: To continue encouraging businesses to intensify their land use, the LIA scheme will be extended till 31 December 2030. a) An initial allowance of 25% of the qualifying capital expenditure incurred on the qualifying building; and The shareholding requirement for building users to be considered as related will be lowered from “at least 75%” to “more than 50%”. This change will apply to LIA applications made from 1 January 2026. BCA and EDB will provide further details by 3Q 2025. b) An annual allowance of 5% of the qualifying capital expenditure incurred over 15 years, upon issuance of the temporary occupation permit for the completed building, subject to conditions. At least 80% of the gross floor area of the qualifying building must be used by the approved recipient or its related users. To be considered related, the users must have at least 75% of their shareholdings held in common (or have entitlement to at least 75% of the income in the case of a partnership), whether directly or indirectly. The scheme is scheduled to lapse after 31 December 2025.\n\n9. Rationalise the tax incentives for Project and Infrastructure Finance\n\nMINISTRY OF FINANCE\n\nThe tax incentives for Project Infrastructure Finance include: To ensure that our tax incentives remain relevant, the QPDS scheme will be allowed to lapse after 31 December 2025. a) Exemption of qualifying income from project debt (“QPDS”); and b) Exemption of qualifying foreign-sourced income received by qualifying offshore infrastructure projects / assets from project bond investors can continue to avail themselves of tax incentives for debt securities such as the Qualifying Debt Securities (“QDS”) scheme, if the debt securities qualify as QDS and the conditions of the QDS scheme are satisfied. Investors of QPDS issued on or before 31 December 2025 will continue to enjoy the tax benefits under the QPDS scheme for the remaining life of the issue of the securities, if the conditions of the QPDS scheme are satisfied. These incentives are scheduled to lapse after 31 December 2025. To support Singapore-based infrastructure project sponsors that leverage Singapore’s financial ecosystem to invest in and finance overseas infrastructure projects, the tax incentive under b) will be extended till 31 December 2030.\n\n10. Extend and refine the Insurance Business Development (“IBD”) scheme\n\nApproved insurers and insurance brokers are granted a concessionary tax rate (“CTR”) of 10% on the relevant qualifying income under the IBD, IBD-Captive Insurance (“IBD-CI”) and IBD-Insurance Broking Business (“IBD-IBB”) schemes. The IBD and IBD-CI schemes are scheduled to lapse after 31 December 2025. To continue supporting Singapore’s value proposition as an Asian insurance and reinsurance centre, the IBD and IBD-CI schemes will be extended till 31 December 2030. Further, to ensure that our tax incentives remain relevant and competitive, an additional CTR tier of 15% will be introduced with effect from 19 February 2025 for the IBD, IBD-CI and IBD-IBB schemes.\n\n11. Introduce an additional CTR tier of 15% for the Financial Sector Incentive (“FSI”) scheme\n\nApproved incentive recipients are eligible for a CTR of 10% or 13.5% on qualifying income (where applicable) under the FSI scheme.\n\nMINISTRY OF FINANCE\n\nMAS will provide further details by 2Q 2025. To ensure that our tax incentives remain relevant and competitive, an additional CTR tier of 15% will be introduced with effect from 19 February 2025 for the FSI-Standard Tier, FSI-Trustee Company and FSI-Headquarter Services schemes. MAS will provide further details by 2Q 2025.\n\n12. Introduce tax incentives recommended by Equities Market Review Group\n\nN/A\n\n13. Extend and enhance the income tax concessions for Real Estate Investment Trusts listed on the Singapore Exchange (“S-REITs”)\n\nThe following income tax concessions are granted to S-REITs and their investors: a) Tax transparency on specified income in the hands of the trustee of the S-REIT if the trustee distributes at least 90% of its specified income to unitholders in the same year that the income is derived by the trustee; b) Tax exemption on qualifying foreign-sourced income received by S-REITs, S-REITs’ wholly-owned Singapore sub-trusts, and S-REITs’ wholly-owned companies incorporated and tax resident in Singapore (“FSIE-REIT”), subject to conditions; c) Tax exemption on S-REITs distributions received by individuals; and d) Final withholding tax (“WHT”) rate of 10% for S-REITs distributions received by qualifying non-tax-resident non-individuals and qualifying non-tax-resident funds. To encourage new listings in Singapore and increase investment demand for Singapore-listed equities, the following tax incentives will be introduced: a) Listing CIT Rebate for new corporate listings in Singapore; b) Enhanced CTR of 5% for new fund manager listings in Singapore; and c) Tax exemption on fund managers’ qualifying income arising from funds investing substantially in Singapore-listed equities. For more information, please refer to Annex C-2. To continue promoting the listing of REITs in Singapore and to sustain Singapore’s position as a global REIT hub, the tax concessions will be extended till 31 December 2030. The scope of specified income for the tax transparency treatment will be expanded to include all co-location and co-working income derived from 1 July 2025. The following refinements will be introduced for FSIE-REIT from 19 February 2025: a) Qualifying foreign-sourced income will include rental and ancillary income received in Singapore from 19 February 2025, subject to conditions; b) The requirement for wholly-owned companies of S-REITs to be incorporated in Singapore will be removed. The wholly-owned companies must still be Singapore tax residents to qualify for the concession; c) Repayment of shareholder loans and return of capital will now be recognised as qualifying modes of remittance for wholly-owned Singapore sub-trusts and wholly-owned Singapore tax resident companies to pass remitted income through to S-REITs; and d) Singapore sub-trusts will be allowed to deduct other operational expenses against their income before passing the remaining amount to S-REITs. IRAS will provide further details by 2Q 2025. The following income tax concessions are granted to S-REIT ETFs and their investors: To support the continued growth of the S-REIT ETFs sector, the sunset date for tax concession a) will be removed. a) Tax transparency in the hands of the trustee of S-REIT ETFs on distributions received by S-REIT ETFs, which are paid out of the latter’s specified income; b) Tax exemption on such S-REIT ETFs distributions received by individuals; and c) Final WHT rate of 10% for S-REIT ETFs distributions received by qualifying non-tax-resident non-individuals and qualifying non-tax-resident funds. The tax concessions at a) and c) are scheduled to lapse after 31 December 2025.\n\n14. Extend the income tax concessions for Real Estate Investment Trust Exchange-Traded Funds (“REIT ETFs”) listed on the Singapore Exchange (“S-REIT ETFs”)\n\nMAS will provide further details by 2Q 2025.\n\n15. Extend the GST remission for S-REITs and Singapore-listed Registered Business Trusts (“RBTs”) in the infrastructure business, ship leasing and aircraft leasing sectors\n\nb) Tax exemption on such S-REIT ETFs distributions received by individuals; and c) Final WHT rate of 10% for S-REIT ETFs distributions received by qualifying non-tax-resident non-individuals and qualifying non-tax-resident funds. The tax concessions at a) and c) are scheduled to lapse after 31 December 2025. GST remission is granted to S-REITs and RBTs in the infrastructure business, ship leasing and aircraft leasing sectors, to allow them to claim input GST on the following, subject to conditions: a) Their business expenses, regardless of whether they hold underlying assets directly or indirectly through multi-tiered structures such as SPVs or sub-trusts; b) Their business expenses incurred to set up SPVs that are used solely to raise funds for the S-REITs or RBTs, and that do not hold qualifying assets of the S-REITs or RBTs, directly or indirectly; and c) Business expenses of financing SPVs mentioned in b). The existing GST remission for S-REITs and RBTs will be extended till 31 December 2030.\n\n16. Allow the Venture Capital Fund Incentive (“VCFI”) and the venture capital Fund Incentive Management (“FMI”) to lapse\n\nUnder the VCFI, approved venture capital funds are granted tax exemption on qualifying income. To ensure that our tax incentives remain relevant, the VCFI and the venture capital FMI will be allowed to lapse after 31 December 2025. Under the venture capital FMI, approved fund management companies are granted a CTR of 5% on management fees and performance bonus derived from managing authorised investments of an approved venture capital fund. Both the VCFI and the venture capital FMI are scheduled to lapse after 31 December 2025. N/A The Government will continue to support the venture capital sector through a holistic suite of policies and initiatives.\n\n17. Introduce the Shipping Arrangement Award (for Containers) and Approved Financing (“ASFA”)\n\nMINISTRY OF FINANCE\n\nto provide withholding tax exemption on interest and related payments made by approved entities to non-tax-resident lenders in respect of qualifying arrangements entered into on or before 31 December 2031 to finance the purchase or construction of ships and containers. Ship and container lease payments made to non-tax-resident lessors (excluding payments derived from any operation carried on by the non-tax-resident through its permanent establishment in Singapore) under finance lease (“FL”) agreements for ASFA Award recipients will also be exempted from WHT. The ASFA Award will be administered by MPA and be introduced with effect from 19 February 2025. MPA will provide further details by 2Q 2025.\n\n18. Extend and enhance the Maritime Sector Incentive (“MSI”)\n\nTo continue developing Singapore as an international maritime centre, the MSI will be extended till 31 December 2031. Similarly, the WHT exemption will be extended for qualifying payments made on qualifying financing arrangements entered into on or before 31 December 2031. To ensure that the MSI remains relevant, the qualifying scope will be updated. Key changes are as follows: a) Expand the scope of prescribed ship management services under the MSI-SRS, MSI-AIS and MSI-SSS to include emission management services; b) Expand the scope of offshore renewable energy activities under the MSI-SRS and MSI-AIS to cover renewable energy generated onshore; c) Expand the scope of ships used for offshore renewable energy activities under the MSI-ML (Ship) that support subsea distribution of renewable energy generated onshore; d) Allow assets leased-in from third parties under FL treated as sale agreements to be recognised as qualifying assets under the MSI-ML (Ship) and MSI-ML (Container) awards; and e) Expand the scope of shipping-related support services under the MSI-SSS to include maritime technology services. These changes will take effect from 19 February 2025. MPA will provide further details by 2Q 2025.\n\n19. Extend the broad-based WHT exemption for container lease payments made to non-tax-resident lessors under operating lease (“OL”) agreements\n\nContainer lease payments made to non-tax-resident lessors (excluding payments derived from any operation carried on by the non-tax-resident through its permanent establishment in Singapore) under OL agreements for the use of qualifying containers for the carriage of goods by sea are exempted from WHT.\n\nTo continue supporting local container lessees in Singapore, the WHT exemption for container lease payments made to non-tax-resident lessors under OL agreements will be extended to agreements entered into on or before 31 December 2031.\n\n20. Extend the broad-based WHT exemption for ship lease payments made to non-tax-resident lessors under FL agreements for MSI recipients\n\nThis exemption is scheduled to lapse after 31 December 2028.\n\nShip and container lease payments made to non-tax-resident lessors (excluding payments derived from any operation carried on by the non-tax-resident through its permanent establishment in Singapore) under FL agreements for specified MSI recipients are exempted from WHT. This exemption is scheduled to lapse after 31 December 2028.\n\n21. Exclude cash top-ups that attract matching grant from the Government under the Matched MediSave Scheme (“MMSS”) from CPF Cash Top-Up Relief\n\nTax resident CPF members may, subject to conditions, enjoy CPF Cash Top-Up Relief for cash top-ups made to their own or their eligible loved ones’ Retirement Account (“RA”) and / or Special Account (“SA”) (excluding any amount of cash top-ups that attract a matching grant under the Matched Retirement Savings Scheme (“MRSS”)); and MediSave Account (“MA”). As the MMSS matching grant announced in Budget 2025 is already a significant benefit extended by the Government, cash top-ups made from 1 January 2026 to the MA of a MMSS-eligible CPF member that attract the MMSS matching grant will not entitle the giver to the CPF Cash Top-Up Relief from YA 2027. This also ensures parity with the current tax treatment for the MRSS, where cash top-ups to the RA or SA of an MRSS-eligible CPF member that attract the MRSS matching grant will not entitle the giver to the CPF Cash Top-Up Relief. A giver may continue to enjoy tax relief of up to $16,000 per year for eligible CPF cash top-ups that do not attract the MMSS or MRSS matching grant. The maximum amount of CPF Cash Top-Up Relief is $8,000 per year for cash top-ups to the giver’s own SA, RA or MA, and another $8,000 per year for cash top-ups to such accounts of the giver’s loved ones. For more information on the MMSS, please refer to Annex F-2.\n\n22. Allow the WHT concession for non-tax-resident arbitrators to lapse\n\nTo ensure parity in the treatment of income of non-tax-resident professionals, the concession for non-tax-resident arbitrators will be allowed to lapse after 31 December 2027. The Government will continue to support the international arbitration sector through a holistic suite of policies and initiatives.\n\n23. Allow the WHT concession for non-tax-resident mediators to lapse\n\nTo ensure parity in the treatment of income of non-tax-resident professionals, the concession for non-tax-resident mediators will be allowed to lapse after 31 December 2027. The Government will continue to support the commercial mediation sector through a holistic suite of policies and initiatives.\n\n24. Introduce the Additional Flat Component (“AFC”) of road tax for electric heavy goods vehicles (“HGVs”) and buses\n\nThe AFC is a lump-sum tax for electric cars, light goods vehicles, and motorcycles. Electric HGVs and buses currently do not pay AFC. For electric HGVs (goods vehicles with a Maximum Laden Weight > 3.5 metric tonnes) registered from 1 January 2026, the road tax schedule will include the following AFC: 6-monthly AFC $50 for the period from January 2026 to 31 December 2026, $75 for the period from 1 January 2027 to 31 December 2027, and $125 for the period from 1 January 2028 onwards. For electric buses with a Maximum Laden Weight ≤ 3.5 metric tonnes registered from 1 January 2026, the road tax schedule will include the following AFC: 6-monthly AFC $25 for the period from January 2026 to 31 December 2026, $50 for the period from 1 January 2027 to 31 December 2027, and $95 for the period from 1 January 2028 onwards. For electric buses with a Maximum Laden Weight >3.5 metric tonnes registered from 1 January 2026, the road tax schedule will include the following AFC: 6-monthly AFC $100 for the period from 1 January 2026 to 31 December 2026, $175 for the period from 1 January 2027 to 31 December 2027, and $275 for the period from 1 January 2028 onwards. For electric HGVs and buses registered up till 31 December 2025, AFC will be waived until 1 January 2029. There is no change to the other components of the road tax schedule for HGVs and buses.",
                "pdf_tags": [
                    "Corporate Income Tax Rate, Rebates & Tax Exemption Schemes",
                    "Personal tax relief",
                    "Personal Tax rebate",
                    "Corporate Income Tax Filing Obligations",
                    "Claiming Reliefs for Foreign Tax Credit, Group Relief, and Loss Carry-back Relief"
                ],
                "pdf_summary": "**Summary of Tax Changes (Annex H-2)**\n\n1. **Corporate Income Tax (CIT) Rebate for YA 2025**: Eligible companies will receive a 50% CIT rebate on tax payable, with a minimum cash grant of $2,000 and a maximum total benefit of $40,000. Eligibility requires at least one local employee in CY 2024.\n\n2. **Personal Income Tax (PIT) Rebate for YA 2025**: A 60% PIT rebate will be provided to all tax resident individuals, capped at $200 per taxpayer.\n\n3. **Extension of Double Tax Deduction for Internationalisation (DTDi)**: The DTDi scheme, allowing a 200% tax deduction on qualifying expenses, is extended until December 31, 2030.\n\n4. **Extension of Mergers and Acquisitions (M&A) Scheme**: The M&A scheme is extended until December 31, 2030, allowing tax benefits for qualifying acquisitions.\n\n5. **Enhancements to Section 13W of the Income Tax Act**: The sunset date for non-taxation of disposal gains from shares is removed, with new conditions for eligibility effective from January 1, 2026.\n\n6. **Tax Deduction for Employee Equity-Based Remuneration (EEBR)**: Companies can claim deductions for payments made for new shares issued under EEBR schemes starting from YA 2026.\n\n7. **Tax Deduction for Cost-Sharing Agreements (CSA)**: A 100% tax deduction for payments under approved CSAs for innovation activities will be introduced from February 19, 2025.\n\n8. **Extension and Enhancement of Land Intensification Allowance (LIA)**: The LIA scheme is extended until December 31, 2030, with changes to shareholding requirements effective from January 1, 2026.\n\n9. **Rationalisation of Project and Infrastructure Finance Tax Incentives**: The QPDS scheme will lapse after December 31, 2025, while other tax incentives for offshore projects will be extended until December 31, 2030.\n\n10. **Extension of Insurance Business Development (IBD) Scheme**: The IBD scheme is extended until December 31, 2030, with an additional concessionary tax rate tier of 15% introduced from February 19, 2025.\n\n11. **Introduction of Additional Concessionary Tax Rate (CTR) Tier for Financial Sector Incentives**: An additional 15% CTR tier will be introduced from February 19, 2025.\n\n12. **Tax Incentives for Real Estate Investment Trusts (S-REITs)**: Tax concessions for S-REITs are extended until December 31, 2030, with refinements to the scope of specified income.\n\n13. **Extension of GST Remission for S-REITs and Registered Business Trusts**: GST remission for these entities will be extended until December 31, 2030.\n\n14. **Lapse of Venture Capital Fund Incentives**: The VCFI and FMI will lapse after December 31, 2025.\n\n15. **Introduction of Shipping Arrangement Award**: A withholding tax exemption for certain payments related to ship and container financing will be introduced from February 19, 2025.\n\n16. **Extension of Maritime Sector Incentive**: The MSI will be extended until December 31, 2031, with updates to the qualifying scope.\n\n17. **Extension of Withholding Tax Exemptions for Container and Ship Lease Payments**: Exemptions for lease payments will be extended until December 31, 2031.\n\n18. **Changes to CPF Cash Top-Up Relief**: Cash top-ups attracting a matching grant under the Matched MediSave Scheme will not qualify for CPF Cash Top-Up Relief from YA 2027.\n\n19. **Lapse of Withholding Tax Concessions for Non-Tax-Resident Arbitrators and Mediators**: These concessions will lapse after December 31, 2027.\n\n20. **Introduction of Additional Flat Component for Electric Heavy Goods Vehicles and Buses**: New road tax schedules for electric vehicles will apply from January 1, 2026, with varying rates based on vehicle type and weight.\n\nThese changes reflect the government's efforts to support businesses, individuals, and specific sectors while ensuring a fair and competitive tax system. Further details and clarifications will be provided by relevant authorities in the coming months.",
                "pdf_embedding_reference": "article_5_pdf_5.json"
            }
        ],
        "tags": [
            "Personal Tax rebate",
            "Personal tax relief",
            "Corporate Income Tax Filing Obligations",
            "Foreigners doing business in Singapore",
            "Individual Income Tax Bill, Payment, and Refund"
        ],
        "_id": "67d16b3aaf834a8f0c318c8f",
        "summary": "The Budget Statement for Financial Year 2025, presented by Prime Minister and Minister for Finance Lawrence Wong, outlines key tax changes and enterprise disbursements in Singapore. Key highlights include:\n\n- Support for businesses through various enhancements to existing schemes.\n- Initiatives aimed at promoting internationalisation and mergers and acquisitions.\n- Tax incentives suggested by the Equities Market Review Group.\n- Introduction of the Matched MediSave Scheme.\n- Measures supporting the SG60 initiative.\n- Additional tax changes that will be detailed in the Ministry of Finance's Annexes.\n\nFor comprehensive details, refer to the Singapore Budget website and the MOF’s Annexes.",
        "embedding_reference": "article_5.json"
    },
    {
        "title": "Over 2 Million Employees to Benefit from Pre-filled Tax Returns; 120,000 AIS Employers to Submit Employees’ Employment Income Data by 1 Mar to Avoid Penalties",
        "url": "https://www.iras.gov.sg/news-events/newsroom/over-2-million-employees-to-benefit-from-pre-filled-tax-returns--120-000-ais-employers-to-submit-employees--employment-income-data-by-1-mar-to-avoid-penalties",
        "text": "{'content': \"Over 2 million employees will benefit from pre-filled tax returns due to the Auto-Inclusion Scheme (AIS). Employers on the AIS must submit their employees' 2024 employment income data to the Inland Revenue Authority of Singapore (IRAS) by 1 March 2025 to avoid penalties. This requirement applies to all employers on the AIS, even those with fewer than 5 employees. Non-compliance is an offence under the Income Tax Act. In 2024, about 11,000 employers missed the AIS deadline, affecting 140,000 employees. This year, 12,500 new employers will join the AIS, bringing the total to around 120,000. Employers who fail to file by the deadline can face fines up to $5,000, and key personnel may face fines up to $10,000 or imprisonment. Common errors in filing include omitting taxable benefits and incorrect reporting of income. Employers are encouraged to voluntarily disclose any past errors to reduce penalties. For the Year of Assessment 2025, over 6,000 AIS employers will no longer need to file as they have ceased operations or have no employees.\", 'urls': ['https://go.gov.sg/iras-iitvdp']}",
        "pdfs": [],
        "tags": [
            "Auto Inclusion Scheme (AIS) for Employment Income",
            "No-Filing Service (NFS) for self-employed persons under the pre-filling of income initiative",
            "Reporting Employee Earnings (IR8A, Appendix 8A, Appendix 8B, IR8S)",
            "Corporate Income Tax Filing Obligations",
            "Individual Income Tax E-filing"
        ],
        "_id": "67d16b3aaf834a8f0c318c90",
        "summary": "The Auto-Inclusion Scheme (AIS) will enable over 2 million employees to benefit from pre-filled tax returns. Employers participating in the AIS must submit their employees' 2024 employment income data to the Inland Revenue Authority of Singapore (IRAS) by March 1, 2025, to avoid penalties. This requirement applies to all AIS employers, including those with fewer than 5 employees. Failure to comply is considered an offence under the Income Tax Act. In 2024, around 11,000 employers missed the AIS deadline, impacting 140,000 employees. This year, 12,500 new employers will join the AIS, totaling approximately 120,000 employers. Non-compliance can result in fines up to $5,000 for employers and up to $10,000 or imprisonment for key personnel. Common filing errors include omitting taxable benefits and incorrect income reporting. Employers are encouraged to voluntarily disclose past errors to mitigate penalties. For the Year of Assessment 2025, over 6,000 AIS employers will not need to file due to ceasing operations or having no employees.",
        "embedding_reference": "article_6.json"
    },
    {
        "title": "Reporting of foreign-sourced disposal gains by partnerships",
        "url": "https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/responsibilities-of-precedent-partners",
        "text": "{'content': \"A Singapore Government Agency Website provides guidance on how to identify official government websites, which end with .gov.sg. It emphasizes that government agencies communicate through these secure websites, and users should look for HTTPS and a lock symbol for added security when sharing sensitive information. \\n\\nResponsibilities of Precedent Partners include ensuring the partnership complies with tax obligations, such as filing the partnership's income tax return and paying any tax due. The partnership must file its income tax return (Form P) by 15 April of the following year, or within 3 months from the end of the financial year if it does not end on 31 December. Tax payments are due by 30 November of the year of assessment, and failure to comply may result in penalties and interest. Proper records of income and expenses must be kept for at least 5 years. If the partnership fails to comply with tax obligations, the precedent partner may be held liable for any tax due, penalties, and interest.\\n\\nIf a business's revenue is less than $500,000, a certified statement of accounts is not required, but proper records must still be maintained. Foreign-sourced income received by resident individuals through a partnership in Singapore is subject to tax unless specifically exempt, and must be reported in Form P.\\n\\nThe precedent partner is the first named in the partnership agreement or appointed by the other partners if no agreement exists. They must file Form P between 1 February and 18 April, inform partners of their income share, lodge objections to adjusted profits, and notify IRAS of any changes in partnership composition or partner status. If a partner ceases or is about to cease being a partner, a written notice must be given to IRAS.\\n\\nFor partnerships with revenue of $500,000 or more, a certified statement of accounts must be submitted with Form P by 18 April. This statement must be signed by the precedent partner, indicating its accuracy, and should include a profit and loss account and balance sheet. If the partnership has incurred losses, it must still file Form P and declare those losses. \\n\\nChanges in partnership details must be reported to IRAS, and partners' statuses (acting or sleeping) must be indicated when filing Form P. Sleeping partners do not qualify for Earned Income Relief on their share of partnership income. \\n\\nFor further assistance, partners can use the myTax Portal for filing and checking the status of their submissions.\", 'urls': ['https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<https:/mytax.iras.gov.sg/ESVWeb/default.aspx?target=MLateFilingPymtHome&toLoginSelection=true>', 'https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<https:/mytax.iras.gov.sg/ESVWeb/default.aspx?target=MPshipViewRetStatus>', 'https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<https:/form.gov.sg/67a9a0f90bad842cc4295138>', 'https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<https:/www.iras.gov.sg/media/docs/default-source/e-tax/tax-treatment-of-gains-or-losses-from-the-sale-of-foreign-assets.pdf?sfvrsn=a0e0458b_10>', 'https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<https:/mytax.iras.gov.sg/login/selection>', 'https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<https:/go.gov.sg/efilingguide>', 'https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<http:/www.bizfile.gov.sg/>', 'https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<https:/www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/calculating-my-business-income/preparing-statement-of-accounts>', 'https://www.iras.gov.sg/taxes/individual-income-tax/self-employed-and-partnerships/tax-obligations-of-partnerships/<https:/www.iras.gov.sg/media/docs/default-source/uploadedfiles/xlsx/statement-of-accounts-for-partnership.xlsx?sfvrsn=44d9e649_19>']}",
        "pdfs": [],
        "tags": [
            "Withholding Tax for Partnership",
            "Foreigners doing business in Singapore",
            "Responsibilities of precedent partners",
            "Foreigners with side and personal income",
            "Foreigners with property in Singapore"
        ],
        "_id": "67d16b3aaf834a8f0c318c91",
        "summary": "**Summary: Reporting of Foreign-Sourced Disposal Gains by Partnerships**\n\nIn Singapore, partnerships must adhere to specific tax obligations, primarily managed by the precedent partner, who is responsible for filing the partnership's income tax return (Form P) and ensuring compliance with tax regulations. Key deadlines include:\n\n- **Filing Deadline**: Form P must be submitted by 15 April of the following year or within 3 months after the financial year-end if it does not conclude on 31 December.\n- **Tax Payment Deadline**: Taxes are due by 30 November of the year of assessment.\n\nPartnerships are required to maintain proper records of income and expenses for at least 5 years. If obligations are not met, the precedent partner may be held liable for any taxes, penalties, and interest incurred.\n\n**Revenue Thresholds**:\n- Partnerships with revenue under $500,000 do not need a certified statement of accounts but must keep accurate records.\n- Partnerships with revenue of $500,000 or more must submit a certified statement of accounts with Form P by 18 April. This statement must be signed by the precedent partner and include a profit and loss account and balance sheet.\n\n**Foreign-Sourced Income**: \nForeign-sourced income received by resident individuals through a partnership is taxable unless exempt and must be reported in Form P.\n\n**Partner Responsibilities**:\nThe precedent partner must inform partners of their income share, lodge objections to adjusted profits, and notify the Inland Revenue Authority of Singapore (IRAS) of any changes in partnership composition or partner status. Written notice to IRAS is required if a partner ceases or is about to cease being a partner.\n\n**Partner Status**: \nWhen filing Form P, partners' statuses (acting or sleeping) must be indicated. Sleeping partners are not eligible for Earned Income Relief on their share of partnership income.\n\nFor assistance, partners can utilize the myTax Portal for filing and checking submission statuses.",
        "embedding_reference": "article_7.json"
    },
    {
        "title": "Reimbursement to employees for transport expenses",
        "url": "https://www.iras.gov.sg/taxes/corporate-income-tax/income-deductions-for-companies/business-expenses/tax-treatment-of-business-expenses-(m-r)",
        "text": "{'content': 'For Q-plated and RU-plated business cars registered before April 1, 1998, the deductibility is capped at $35,000 multiplied by the motor vehicle expenses related to that vehicle divided by the cost of the vehicle. Generally, reinstatement costs incurred to restore premises to their original condition before vacating are not tax-deductible as they are considered capital expenditure. However, tax deductions can be claimed for reinstatement costs if they do not relate to provisions made under the Financial Reporting Standard 161, are contractually provided for in the tenancy agreement, and the premises are not vacated due to cessation of business. Tax deductions can be claimed for qualifying renovation or refurbishment expenses under Section 14N of the Income Tax Act 1947, but these do not qualify for capital allowances. The deduction applies to businesses carrying on a trade, business, or profession, but investment holding companies do not qualify. Supporting documents must be kept and submitted upon request by IRAS. Items that qualify for Section 14N deduction include general electrical installations, lighting, plumbing, kitchen fittings, sanitary fittings, doors, windows, and various other renovations that do not affect the structure of the premises. Deductions are not allowed for designer fees, antiques, fine art, or works carried out to a place of residence provided to employees. Rental expenses incurred on premises occupied for business purposes can be claimed as tax deductions based on actual rental payments. Contractual retrenchment payments are tax-deductible, while ex-gratia payments are deductible only if the business continues. Outplacement support costs are generally tax-deductible if the business continues. Medical expenses incurred for employees are tax-deductible up to 1% of total employee remuneration, increasing to 2% with certain conditions. Motor vehicle expenses for goods and commercial vehicles are tax-deductible, but not for private cars. Tax deductions can be claimed on qualifying costs incurred in registering intellectual property rights. Renovation costs affecting the structure may qualify for Land Intensification Allowance if approved. R&R expenditure is capped at $300,000 for every relevant 3-year period, and businesses that do not carry on a trade throughout the period will still be allowed the full cap. Unutilised Section 14N deductions can be transferred under the Group Relief system, carried back to the preceding YA, or carried forward to future YAs.', 'urls': ['https://www.iras.gov.sg/taxes/corporate-income-tax/income-deductions-for-companies/business-expenses/<https:/www.iras.gov.sg/schemes/disbursement-schemes/enterprise-innovation-scheme-\\\\(eis\\\\)>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/income-deductions-for-companies/business-expenses/<https:/www.iras.gov.sg/media/docs/default-source/e-tax/etaxguide_cit_enterprise-innovation-scheme.pdf?sfvrsn=3a36afd3_7>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/income-deductions-for-companies/business-expenses/<https:/form.gov.sg/65dfeed0e602e8d2e76e85c1>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/income-deductions-for-companies/business-expenses/<https:/www.iras.gov.sg/media/docs/default-source/uploadedfiles/pdf/examples-on-computing-the-medical-expense-capping.pdf?sfvrsn=562b8b17_2>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/income-deductions-for-companies/business-expenses/claiming-reliefs/group-relief', 'https://www.iras.gov.sg/taxes/corporate-income-tax/income-deductions-for-companies/business-expenses/claiming-reliefs/loss-carry-back-relief', 'https://www.iras.gov.sg/taxes/corporate-income-tax/income-deductions-for-companies/business-expenses/unutilised-items-\\\\(capital-allowances-trade-losses-donations\\\\)#title2']}",
        "pdfs": [],
        "tags": [
            "Personal tax relief",
            "Foreigners with property in Singapore",
            "Reporting Employee Earnings (IR8A, Appendix 8A, Appendix 8B, IR8S)",
            "Taxability for Employment Income",
            "Tourist Refund Scheme (TRS)"
        ],
        "_id": "67d16b3aaf834a8f0c318c92",
        "summary": "The article outlines key tax information regarding reimbursements for transport expenses and related deductions for businesses. \n\n1. **Vehicle Expense Deductibility**: For Q-plated and RU-plated business cars registered before April 1, 1998, deductions are capped at $35,000 multiplied by the motor vehicle expenses related to that vehicle divided by the vehicle's cost.\n\n2. **Reinstatement Costs**: Generally, reinstatement costs to restore premises are not tax-deductible as they are capital expenditures. However, deductions are allowed if:\n   - They do not relate to provisions under Financial Reporting Standard 161.\n   - They are contractually provided for in the tenancy agreement.\n   - The premises are not vacated due to business cessation.\n\n3. **Renovation and Refurbishment**: Under Section 14N of the Income Tax Act 1947, businesses can claim deductions for qualifying renovation or refurbishment expenses, but these do not qualify for capital allowances. Eligible items include electrical installations, plumbing, and various renovations that do not affect the structure. Designer fees and expenses for residential properties are not deductible.\n\n4. **Rental Expenses**: Rental expenses for business premises can be claimed based on actual payments.\n\n5. **Retrenchment Payments**: Contractual retrenchment payments are tax-deductible, while ex-gratia payments are deductible only if the business continues. Outplacement support costs are generally deductible under the same condition.\n\n6. **Medical Expenses**: Medical expenses for employees are deductible up to 1% of total employee remuneration, increasing to 2% under specific conditions.\n\n7. **Motor Vehicle Expenses**: Deductions for motor vehicle expenses are applicable for goods and commercial vehicles, but not for private cars.\n\n8. **Intellectual Property Costs**: Tax deductions can be claimed for qualifying costs related to registering intellectual property rights.\n\n9. **Land Intensification Allowance**: Renovation costs affecting structure may qualify for this allowance if approved.\n\n10. **R&R Expenditure Cap**: Renovation and refurbishment expenditure is capped at $300,000 for every relevant 3-year period, with full cap allowance for businesses not trading throughout the period.\n\n11. **Section 14N Deductions**: Unutilized deductions can be transferred under the Group Relief system, carried back to the preceding Year of Assessment (YA), or carried forward to future YAs.\n\nSupporting documents must be maintained and provided upon request by the Inland Revenue Authority of Singapore (IRAS).",
        "embedding_reference": "article_8.json"
    },
    {
        "title": "Transfer Pricing",
        "url": "https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/transfer-pricing",
        "text": "{'content': \"This article provides guidance on how to identify official Singapore government agency websites. Official websites end with .gov.sg, and government agencies communicate through these sites. It is important to ensure that websites are secure, indicated by HTTPS and a lock symbol, especially when sharing sensitive information. The article also covers various topics related to taxes, including corporate income tax, transfer pricing, and compliance requirements. It emphasizes the importance of adhering to the arm's length principle in related party transactions, which ensures that pricing reflects independent market conditions. Taxpayers must maintain proper documentation to demonstrate compliance with these principles and avoid penalties for non-compliance. Additionally, the article discusses the implications of government assistance on transfer pricing and the requirements for reporting related party transactions. It also outlines the penalties for failing to comply with transfer pricing documentation requirements.\", 'urls': ['https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<https:/go.gov.sg/trusted-sites>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<who-we-are>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<who-we-are/what-we-do>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<taxes>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<taxes/corporate-income-tax>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<taxes/corporate-income-tax/specific-topics/transfer-pricing>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<taxes/property-tax>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<taxes/goods-services-tax-(gst)>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<taxes/withholding-tax>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<taxes/international-tax>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<taxes/other-taxes>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<digital-services>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<schemes>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<digital-collaboration>', 'https://www.iras.gov.sg/media/docs/default-source/e-tax/etaxguide_cit_transfer-pricing-guidelines_7th.pdf?sfvrsn=26bfb1a6_18', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<#applying-the-arm-s-length-principle-to-related-party-financial-transactions>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<#applying-the-arm-s-length-principle-to-cost-contribution-arrangements>', 'https://www.iras.gov.sg/taxes/corporate-income-tax/specific-topics/<#indicativemargin>']}",
        "pdfs": [
            {
                "pdf_title": "etaxguide_cit_transfer-pricing-guidelines_7th",
                "pdf_url": "https://www.iras.gov.sg/media/docs/default-source/e-tax/etaxguide_cit_transfer-pricing-guidelines_7th.pdf?sfvrsn=26bfb1a6_18",
                "processed_text": "IRAS e-Tax Guide\n\nTransfer Pricing Guidelines (Seventh Edition)\n\nPublished by Inland Revenue Authority of Singapore\n\nPublished on 14 Jun 2024\n\nFirst edition on 23 Feb 2006\nSecond edition on 06 Jan 2015\nThird edition on 04 Jan 2016\nFourth edition on 12 Jan 2017\nFifth edition on 23 Feb 2018\nSixth edition on 10 Aug 2021\n\nDisclaimers: IRAS shall not be responsible or held accountable in any way for any damage, loss or expense whatsoever, arising directly or indirectly from any inaccuracy or incompleteness in the Contents of this e-Tax Guide, or errors or omissions in the transmission of the Contents. IRAS shall not be responsible or held accountable in any way for any decision made or action taken by you or any third party in reliance upon the Contents in this e-Tax Guide. This information aims to provide a better general understanding of taxpayers’ tax obligations and is not intended to comprehensively address all possible tax issues that may arise. While every effort has been made to ensure that this information is consistent with existing law and practice, should there be any changes, IRAS reserves the right to vary its position accordingly.\n\n© Inland Revenue Authority of Singapore\n\nAll rights reserved. No part of this publication may be reproduced or transmitted in any form or by any means, including photocopying and recording without the written permission of the copyright holder, application for which should be addressed to the publisher. Such written permission must also be obtained before any part of this publication is stored in a retrieval system of any nature.\n\nTransfer Pricing Guidelines\n\nAim\n\nThis e-Tax guide helps taxpayers in:\n\n(a) Applying the arm’s length principle when transacting with their related parties;\n\n(b) Applying the arm’s length principle for specific transactions, like related party services and loans;\n\n(c) Maintaining transfer pricing documentation;\n\n(d) Applying the facilities provided under the avoidance of double taxation agreements (“DTA”) to avoid or resolve transfer pricing disputes; and\n\n(e) Understanding the implications of non-compliance with transfer pricing requirements.\n\nIt explains IRAS’ transfer pricing compliance programme and position regarding various transfer pricing matters.\n\nIt is organised in parts, with Part I being most relevant for taxpayers seeking to understand and comply with transfer pricing requirements.\n\nThis e-Tax guide is relevant to you if you are a business entity incorporated or registered in Singapore or carrying on a business in Singapore and have transactions with your related parties.\n\nAt a glance\n\nTransfer pricing concerns the prices charged in transactions between related parties.\n\nGenerally, unrelated parties transact with each other at prices approximating to the market price. This may not necessarily be the case when two related parties transact with each other. It is important to the integrity of the tax system that the price for the transaction between related parties approximates to the market price.\n\nTo prevent price distortion, tax authorities may audit the prices of transactions between related parties to verify if they are reflective of market prices. Such audit can lead to transfer pricing adjustments bringing about double taxation.\n\nTo reduce the risk of audits and double taxation, when transacting with their related parties, taxpayers should ensure the transfer price between them is arm’s length as if they were unrelated parties negotiating freely. Taxpayers should also maintain proper transfer pricing documentation to demonstrate that the pricing is arm’s length.\n\nIf taxpayers are faced with double taxation, they may apply for a mutual agreement procedure with their tax authorities under the DTA provisions to eliminate double taxation. They may also apply for an advance pricing arrangement to agree in advance with one or more tax authorities the appropriate transfer pricing for their related party transactions for a period of time.\n\nGlossary\n\nAdvance pricing arrangement\n\nThis is an arrangement between IRAS and the taxpayer or the relevant foreign competent authority to agree in advance an appropriate set of criteria to ascertain the transfer pricing for a taxpayer’s related party transactions for a specific period of time.\n\nArm’s length principle\n\nThe arm’s length principle is the international standard to guide transfer pricing. It requires the transaction with a related party to be made under comparable conditions and circumstances as a transaction with an independent party.\n\nArm’s length range\n\nA range of prices or margins that is acceptable for establishing that the conditions of a related party transaction are arm’s length.\n\nComparability analysis\n\nThe process of identifying economically relevant characteristics in a related party transaction and comparing such characteristics with those in independent party transactions. This involves an examination of the factors affecting the related party transaction that are non-existent in transactions between independent parties and vice-versa.\n\nComparable independent party transaction\n\nA comparable independent party transaction is a transaction between two independent parties that is comparable to the related party transaction under examination. It can be either a comparable transaction between one party which is a party to the related party transaction and two independent parties, neither of which is a party to the related party transaction (“external comparable”) or between independent party transactions (“internal comparable”).\n\nComparable uncontrolled price (“CUP”) method\n\nA transfer pricing method that compares the price for properties or services transferred in a related party transaction to the price charged for properties or services transferred in an independent party transaction in comparable circumstances.\n\nCompetent Authority\n\nThis refers to a person or an organisation that has been appointed or delegated to perform a designated function. IRAS is the designated competent authority for matters relating to transfer pricing, which include advance pricing arrangement and mutual agreement procedure.\n\nContribution analysis\n\nAn analysis used in the transactional profit split method under which the total profit earned by the parties from a related party transaction is divided based on the parties’ relative contributions to the earning of that profit.\n\nCorresponding adjustment\n\nWhen a tax authority increases a taxpayer’s taxable profits as a result of applying the arm’s length principle to the taxpayer’s transactions with its related party in another jurisdiction, double taxation arises if the same profits have been or will be included in the tax base of the related party. To eliminate the double taxation, the tax authority in the other jurisdiction may agree to reduce the taxable profits of that related party. Such a downward adjustment to the related party’s taxable profit is known as corresponding adjustment.\n\nCost plus method\n\nA transfer pricing method where a comparable gross mark up is added to the costs incurred by the supplier of goods or services in a related party transaction to arrive at the arm’s length price of that transaction.\n\nDirect costs\n\nCosts that are incurred specifically for producing a product or providing a service, such as the cost of raw materials.\n\nDouble taxation\n\nWhere two or more tax authorities take different positions in determining arm’s length prices, double taxation may occur. Double taxation means that the same income is included in the tax base by two or more tax authorities, but this does not always mean that the income will actually be taxed twice.\n\nDTA (or Avoidance of Double Taxation Agreement)\n\nDTA refers to agreements between governments for the avoidance of double taxation and prevention of fiscal evasion of income taxes or commonly known as tax treaties.\n\nFAR\n\nFAR refers to Functions performed, Assets used and Risks assumed.\n\nFunctional analysis\n\nA functional analysis seeks to identify the economically significant activities and responsibilities undertaken, assets used or contributed, and risks assumed by the parties to the transactions.\n\nGross profits\n\nThe amount computed by deducting from the gross receipts of a business transaction the allocable purchases or production costs of sales, with due adjustment for increases or decreases in inventory or stock-in-trade, but without taking account of other expenses.\n\nIndependent parties (or unrelated parties)\n\nTwo parties are independent (or unrelated) parties with respect to each other if they are not related parties with respect to each other.\n\nIndependent (or unrelated) party transactions\n\nTransactions between independent (or unrelated) parties.\n\nIndirect costs\n\nCosts of producing a product or service which, although closely related to the production process, may be common to several products or services (for example, the costs of a repair department that services equipment used to produce different products).\n\nITA\n\nITA refers to the Income Tax Act 1947.\n\nMutual agreement procedure\n\nThis is a facility through which IRAS and the relevant foreign competent authority resolve disputes regarding the application of DTAs.\n\nNet profit indicator (or profit level indicator)\n\nThe ratio of net profit to an appropriate base (for example, costs, sales, assets) as used in the transactional net margin method.\n\nOECD TPG\n\nOECD TPG refers to the OECD Transfer Pricing Guidelines for Multinational Enterprises and Tax Administrations.\n\nRelated party\n\nTwo persons are related parties with respect to each other if:\n\n(a) Either person, directly or indirectly, controls the other person; or\n\n(b) Both persons are, directly or indirectly, controlled by a common person.\n\nThe exact wordings of the definition are provided under Section 2 of the ITA.\n\nRelated party transactions\n\nTransactions between related parties.\n\nResale price margin\n\nA margin representing the amount out of which a reseller would seek to cover its selling and other operating expenses and, in the light of the functions performed (taking into account assets used and risks assumed), make an appropriate profit.\n\nResale price method\n\nA transfer pricing method where the resale price to the independent party is reduced by a comparable resale price margin to arrive at the arm’s length price of the product transferred between the related parties.\n\nResidual analysis\n\nAn analysis used in the transactional profit split method under which the total profit earned by the parties from a related party transaction is split in two stages: firstly, by determining the return for readily identifiable functions attributed to each party involved and secondly, by dividing the residual profit.\n\nSelf-initiated retrospective adjustments\n\nDue to subsequent changes in circumstances, some taxpayers may review their past transfer prices relating to the transactions with their related parties. Arising from such review, they may decide to make retrospective upward or downward adjustments for past financial years to arrive at what, in the taxpayers’ opinion, would be the arm’s length prices. These adjustments are referred to as self-initiated retrospective adjustments.\n\nTested party\n\nThe use of resale price method, cost plus method or transactional net margin method requires a decision on which party to apply the transfer pricing analysis. This party is known as the tested party. Generally, the tested party is the one where a transfer pricing method can be applied in the most reliable manner and most reliable comparables can be found.\n\nTP Documentation Rules\n\nTP Documentation Rules refers to the Income Tax (Transfer Pricing Documentation) Rules 2018.\n\nTraditional transaction methods\n\nTransfer pricing methods that compare the prices of related party transactions with those of transactions between independent parties, namely the comparable uncontrolled price method, the resale price method, and the cost plus method.\n\nTransactional net margin method (“TNMM”)\n\nA transfer pricing method that compares the net profit relative to an appropriate base (for example, costs, sales, assets) that is attained by a taxpayer from a related party transaction to that of comparable independent parties.\n\nTransactional profit methods\n\nTransfer pricing methods that compare the profits arising from related party transactions with those generated in independent party transactions, such as the transactional net margin method and transactional profit split method.\n\nTransactional profit split method\n\nA transfer pricing method that is based on the concept of splitting the combined profits of a transaction between related parties in a similar way as how independent parties would under comparable circumstances.\n\nTransfer pricing adjustment\n\nIn the event the related parties do not transact with each other at arm’s length prices, tax authorities may for tax purposes, substitute the price of the transaction with one that could have been charged if the parties were unrelated. The adjustment to arrive at that price is known as a transfer pricing adjustment.\n\nYA\n\nYA refers to year of assessment.\n\nYear-end adjustments\n\nAdjustments which taxpayers made to their actual results at the year-end closing of their accounts to arrive at what, in the taxpayers’ opinion, would be the arm’s length prices for their related party transactions as described in their transfer pricing analyses and policies.\n\nPART I – TRANSFER PRICING PRINCIPLES AND FUNDAMENTALS\n\nBackground\n\nTransfer pricing refers to the rules and methods for pricing transactions between related parties. Such transactions can be sale or purchase of goods, provision of services, borrowing or lending of money, use or transfer of intangibles, etc.\n\nTwo persons are related parties with respect to each other if:\n\n(a) Either person, directly or indirectly, controls the other person; or\n\n(b) Both persons are, directly or indirectly, controlled by a common person.\n\nWhere a non-resident person carries on a business through a permanent establishment in Singapore, for the purpose of attributing profits to the permanent establishment:\n\n(a) The permanent establishment in Singapore of that person; and\n\n(b) Other permanent establishments outside Singapore of that person\n\nare treated as separate and distinct persons. They are considered related parties and accordingly the arm’s length principle applies to them when attributing profits to the permanent establishment in Singapore.\n\nWhen related parties transact with each other, their pricing may not reflect market conditions due to a lack of independence in their commercial and financial relations. As a result, their profits and tax liabilities may be distorted, especially when they are located in different jurisdictions with different tax rates. This creates concerns that the related parties may not be paying their fair share of tax and are able to derive a tax advantage as a group.\n\nTo ensure taxpayers transact with their related parties at pricing that reflects independent pricing, IRAS applies the internationally endorsed arm’s length principle. If taxpayers do not comply with the arm’s length principle and have understated their profits, IRAS will adjust their profits upwards as provided in the Income Tax Act 1947 (“ITA”).\n\nForeign tax authorities will likewise make upward adjustments when they find the transfer pricing of the cross-border related party transactions is not at arm’s length. Such transfer pricing adjustments, by IRAS or the foreign tax authorities, may lead to double taxation.\n\nThus, it is important that taxpayers comply with the arm’s length principle when transacting with their related parties and maintain proper transfer pricing documentation to substantiate their pricing.\n\nIRAS generally takes guidance from the OECD Transfer Pricing Guidelines for Multinational Enterprises and Tax Administrations (“OECD TPG”).\n\nThe arm’s length principle\n\nIntroduction\n\nIRAS endorses the arm’s length principle as the standard to guide transfer pricing. IRAS subscribes to the principle that profits should be taxed where the real economic activities generating the profits are performed and where value is created. A proper application of the transfer pricing rules would ensure this outcome.\n\nThis section covers the following:\n\n(a) What the arm’s length principle is;\n\n(b) Basis for the arm’s length principle;\n\n(c) Reasons for endorsing the arm’s length principle;\n\n(d) Guiding principles on applying the arm’s length principle; and\n\n(e) Three-step approach to apply the arm’s length principle.\n\nWhat the arm’s length principle is\n\nThe arm’s length principle requires a transaction with a related party to be made under comparable conditions and circumstances as a transaction with an independent party. The premise is that where market forces drive the terms and conditions agreed in an independent party transaction, the pricing of the transaction would reflect the true economic value of the contributions made by each party in that transaction.\n\nTherefore, if two related parties derive profits at levels above or below the comparable market level solely because of their special relationship, the profits will be deemed as non-arm’s length. In such a case, IRAS can make necessary adjustments to the taxable profits of the taxpayer in Singapore. This is to reflect the true price that would be derived on an arm’s length basis.\n\nBasis for the arm’s length principle\n\nSection 34D of the ITA stipulates the use of the arm’s length principle for related party transactions, i.e. the conditions made or imposed between related parties with regard to their transaction are those conditions which would be made or imposed if they were not related parties and dealing independently with one another in comparable circumstances (“arm’s length conditions”).\n\nThe concept or use of the principle is also implied or referred to in various provisions of the ITA, including Sections 32 and 53.\n\nThe arm’s length principle is found in all of Singapore’s DTAs, typically in:\n\n(a) Paragraph 2 of the Business Profits Article\n\nWhen attributing profits in a contracting state/party to a permanent establishment in that state/party, the permanent establishment should be considered as “a separate and independent enterprise engaged in the same or similar activities under the same or similar conditions”.\n\n(b) Paragraph 1 of the Associated Enterprises Article\n\n“Where…conditions are made or imposed between…two [associated] enterprises in their commercial or financial relations which differ from those which would be made between independent enterprises, then any profits which would, but for those conditions, have not so accrued, may be included in the profits of that enterprise and taxed accordingly.”\n\nThe DTA requires the application of the arm’s length principle not only between associated enterprises but also between a permanent establishment of a person in Singapore and other permanent establishments of that person outside Singapore. The profits attributable to the permanent establishment in Singapore are the profits that the permanent establishment would have derived if it were a separate and independent enterprise engaged in the same or similar activities under the same or similar conditions.\n\nReasons for endorsing the arm’s length principle\n\nIRAS endorses the use of the arm’s length principle for two main reasons:\n\n(a) Market forces of supply and demand are the best way to allocate resources and reward effort. Applying the arm’s length principle would result in related and independent party transactions being treated equally for tax purposes.\n\n(b) Most tax jurisdictions adopt the arm’s length principle. In doing so, taxpayers and tax authorities will have a common basis to deal with related party transactions. This should reduce the incidence of transfer pricing adjustments and improve the resolution of transfer pricing disputes. Consequently, the likelihood of double taxation will be reduced.\n\nGuiding principles on applying the arm’s length principle\n\nIRAS recognises that the application of the arm’s length principle is not without difficulties. For instance:\n\n(a) Certain business structures and arrangements are complicated and unique, and may rarely be encountered between independent parties. The lack of comparable conditions established between independent parties makes it difficult to apply the arm’s length principle.\n\n(b) Establishing the arm’s length principle may require substantial analysis of large volume of data and information. Some information may not be readily available or may be of a confidential nature that cannot be disclosed without revealing business secrets.\n\n(c) It may also be costly for taxpayers to perform comprehensive analyses in applying the arm’s length principle and prepare sufficient documentation to demonstrate compliance with the arm’s length principle.\n\nTherefore, IRAS adopts the following guiding principles on applying the arm’s length principle:\n\n(a) Transfer pricing is not an exact science. Establishing and demonstrating compliance with the arm’s length principle require the exercise of judgment. Hence, a pragmatic approach would be adopted in ascertaining arm’s length pricing for related party transactions.\n\n(b) IRAS does not expect taxpayers to adhere rigidly to a defined set of rules in order to establish arm’s length pricing. Depending on the facts and circumstances, i.e. where there is a reasonable basis for doing so, taxpayers may determine and demonstrate arm’s length pricing using a different approach from those suggested in this e-Tax guide or complement those approaches suggested in this e-Tax guide.\n\n(c) Taxpayers would have intimate knowledge of the commercial circumstances that their businesses operate in and the economic relationships between various related parties. This puts them in a better position to perform a robust and comprehensive transfer pricing analysis to determine the arm’s length price.\n\n(d) Taxpayers should exert reasonable efforts to undertake a sound transfer pricing analysis. IRAS will consider the transfer prices determined as, prima facie, arm’s length when taxpayers have:\n\n• Applied the arm’s length principle in their analysis; and\n\n• Exercised reasonable efforts to comply with the arm’s length principle, i.e. the transfer prices may reasonably be considered to approximate to arm’s length prices.\n\n(e) IRAS welcomes taxpayers to discuss their concerns and difficulties in applying the arm’s length principle. IRAS believes that such consultation and cooperation between taxpayers and IRAS is a mutually beneficial and pragmatic way to assist taxpayers in complying with the arm’s length principle.\n\nThree-step approach to apply the arm’s length principle\n\nIRAS recommends that taxpayers adopt the following three-step approach to apply the arm’s length principle in their related party transactions:\n\nStep 1 - Conduct comparability analysis\n\nStep 2 - Identify the most appropriate transfer pricing method and tested party\n\nStep 3 - Determine the arm’s length results\n\nTransfer pricing analysis always requires an element of judgment. Ultimately, the main objective in any transfer pricing analysis is to present a logical, coherent and consistent basis to demonstrate that transfer prices set between related parties are at arm’s length.\n\nThe recommended three-step approach is neither mandatory nor prescriptive. A taxpayer can modify the recommended approach or adopt an alternative approach if its individual circumstances require such modifications to better arrive at the arm’s length result.\n\nStep 1 – Conduct comparability analysis\n\nComparability analysis is at the heart of the application of the arm’s length principle. This requires:\n\n(a) Identifying the commercial or financial relations between the related parties and the conditions and economically relevant circumstances attaching to those relations in order that the transaction between the related parties is accurately delineated.\n\n(b) Comparing the conditions and relevant circumstances of the related party transaction as accurately delineated with the conditions and the economically relevant circumstances of comparable transactions between independent parties.\n\nThe comparability analysis conducted under Step 1 will have:\n\n(a) Set out the factual substance of the commercial or financial relations between the related parties and accurately delineated the actual transaction;\n\n(b) Compared the economically relevant characteristics of the actual related party transaction and independent party transactions;\n\n(c) Identified the differences (if any) in the economically relevant characteristics between the related party transaction and the independent party transactions that can materially affect the price of the related party transaction; and\n\n(d) Determined reasonably accurate adjustments that can be made to eliminate the effect of any such differences.\n\nIdentifying the actual related party transaction\n\nThe process of identifying the commercial or financial relations between the related parties and the conditions and economically relevant circumstances attaching to those relations requires:\n\n(a) A broad understanding of the industry sector in which the group operates.\n\n(b) An analysis of what each party does and their commercial or financial relations as expressed in the transaction or transactions between them.\n\n(c) The accurate delineation of the actual transaction or transactions between them.\n\nThe accurate delineation of the actual transaction between the related parties requires establishing the economically relevant characteristics of the transaction. Such characteristics consist of the conditions of the transaction and the circumstances in which the transaction takes place. They can be broadly categorised as:\n\n(a) The contractual terms of the transaction;\n\n(b) The characteristics of goods sold or purchased, services received or provided, or intangible properties used or transferred;\n\n(c) The functions performed, assets used and risks assumed by the parties; and\n\n(d) The commercial and economic circumstances of the parties.\n\nContractual terms of the transaction\n\nA transaction is the consequence of the commercial or financial relations between the related parties.\n\nWhere a transaction has been formalised by the related parties through written contractual agreements, those agreements provide the starting point for delineating the transaction between them, how the transaction is priced and how the responsibilities and risks arising from their interaction are to be divided between them at the time of entering into the agreements.\n\nWritten contractual agreements alone may not provide all the information necessary to perform a transfer pricing analysis, or to provide sufficient information regarding the contractual terms.\n\nFurther information will be required by taking into consideration the analysis of the other economically relevant characteristics mentioned in paragraphs 5.18(b) to (d). Taken together, the analysis provides evidence of the actual conduct of the related parties with regard to the transaction.\n\nWhere conduct is not fully consistent with the contractual terms, further analysis is required to identify the actual transaction.\n\nWhere there are material differences between the contractual terms and the actual conduct of the related parties, the actual transaction should be determined from the actual conduct.\n\nExample:\n\n• Parent Co in Country P has a distribution agreement with its subsidiary, Sub Co, in Country S.\n\n• Under the distribution agreement, Sub Co is to distribute Parent Co’s products and to conduct marketing activities in Country S.\n\n• Based on an analysis of the other economically relevant characteristics mentioned in paragraphs 5.18(b) to (d), it was determined that:\n\no All marketing activities are undertaken by Parent Co, i.e. full responsibility lies with Parent Co.\n\no Sub Co does not have the capability to perform marketing activities.\n\no Sub Co merely distributes the products without performing any marketing activities or incurring any costs relating to such activities.\n\n• Based on the actual conduct of Parent Co and Sub Co, it can be concluded that the written agreement does not reflect the actual conduct of the parties.\n\n• Thus, the identification of the actual transaction between Parent Co and Sub Co should not be based solely on the written agreement but should be determined from their actual conduct.\n\nWhere there is no written contractual agreement between the related parties, all aspects of the arrangement would need to be deduced from available evidence of the actual conduct of the parties. This includes the functions that are actually performed, the assets that are actually used or contributed and the risks actually assumed by the parties.\n\nCharacteristics of goods, services or intangible properties\n\nThe specific characteristics of goods, services or intangible properties play a significant part in determining their values in the open market. For instance, a product with better quality and more features would, all other things being equal, fetch a higher selling price. In other words, product or service differentiation affects the price or value of the product or service.\n\nThe nature and features of goods, intangible properties or services transacted between related parties and those between independent parties must be examined carefully. Similarities and differences should be identified as these would influence their value.\n\nImportant characteristics to be examined include:\n\nNature of transaction\n\nPossible comparisons\n\nTransfer of goods\n\n• Physical features\n• Quality and reliability\n• Availability and volume of supply\n\nProvision of services\n\nNature and extent of the services\n\nIntangible properties\n\n• Form of transaction\n• Type and nature of the intangible property\n• Duration and extent of rights provided by the intangible property\n• Anticipated benefits from the use of the intangible property\n\nIf the comparable uncontrolled price (“CUP”) method is chosen as the most appropriate transfer pricing method (see Step 2 below), ensuring similarities in the actual characteristics of the product, intangible or service would be the most critical when conducting a comparability analysis.\n\nOn the other hand, comparisons of profit margins (as used in transfer pricing methods other than CUP) may be less sensitive to the characteristics of the product or service in question. This is because the margins generally correlate more significantly with the functions performed, assets used and risks assumed by the taxpayer.\n\nFunctional analysis on Functions performed, Assets used and Risks assumed (“FAR”)\n\nIn transactions between two independent parties, compensation will usually reflect the functions that each enterprise performs, taking into account assets used and risks assumed. The same principle applies to transactions between related parties. Hence, a crucial step in comparability analysis is to conduct a “functional analysis” to delineate the related party transaction and determine comparability between the related party transaction and the independent party transactions.\n\nA functional analysis seeks to identify the economically significant activities and responsibilities undertaken, assets used or contributed, and risks assumed by the parties to the transactions.\n\nThe analysis focuses on what the parties actually do and the capabilities they provide. Such activities and capabilities will include decision-making. For example, decisions about business strategy and risks.\n\nThe analysis also considers the type of assets used (such as plant and equipment, valuable intangibles, financial assets, etc.) and the nature of the assets used (such as the age, market value, location, property right protections available, etc.)\n\nIdentifying risks goes hand in hand with identifying functions and assets. Risks are the effect of uncertainty on the objectives of the business. The actual assumption of risks by a taxpayer to a transaction can significantly affect the pricing of that transaction at arm’s length. Thus, when analysing risks, taxpayers should observe:\n\n(a) The effect of the risks assumed may not be apparent in the financial statements. This does not mean that the risks do not exist but it can be that the risks have been effectively managed. Therefore, taxpayer should conduct thorough functional analysis to determine what risks have been assumed, what functions are performed that relate to or affect the assumption or impact of these risks and which party or parties to the transaction assume these risks.\n\n(b) The pricing of the actual transaction should take into account the financial and other consequences of risk assumption and the remuneration for risk management. A taxpayer who assumes a risk is entitled to the upside benefits and incurs the downside costs. A taxpayer who assumes and mitigates the risk will be entitled to a greater remuneration than a taxpayer who only assumes or only mitigates the risk and does not do both.\n\n(c) To assume a risk for transfer pricing purposes, the taxpayer needs to control the risk and has the financial capacity to assume the risk.\n\nExamples:\n\n• If taxpayer claims that it assumes credit risk when customers default on payments, it would need to demonstrate that it has:\no The financial capacity to assume the risk (such as availability of credit lines from banks),\no The capability and authority to decide to take on, lay off or decline the risk-bearing opportunity, together with the actual performance of that decision-making function, (such as whether or not to sell the product to the customer or whether or not to sell on credit to customer), and\no The capability and authority to decide whether and how to respond to the risk (such as taking legal action to recover the debt).\nTaxpayer may outsource its day-to-day mitigation activities, such as credit risk analysis. However, it has to demonstrate that it has the capability to determine the objective of outsourcing the credit risk analysis, who it wants to hire to perform the credit risk analysis, etc.\n\n• If taxpayer claims that it assumes inventory obsolescence risk, it would need to demonstrate that it has:\no The financial capacity to assume the risk,\no The capability and authority to decide to take on, lay off or decline the risk (such as whether or not to sell a slow-moving product), and\no The capability and authority to decide whether and how to respond to the risk (such as conducting marketing campaigns to boost ailing sales or employing a diversification strategy).\n\nTheoretically, the level of return derived by a taxpayer should be directly correlated to the FAR. For instance, a taxpayer selling a product with warranty should earn a higher return compared to another taxpayer selling the same product without the warranty. The difference in margin is due to the additional function performed and risk assumed by the first taxpayer. Likewise, a product with a reputable branding is expected to fetch a higher return compared to that of a similar product without the branding. This is due to the additional asset (in this case, trademark) employed in enhancing the value of the product.\n\nThe example below illustrates that arm’s length compensation should reflect the outcome of a functional analysis.\n\nExample:\n\n• Company A is in the business of distributing general household electrical products in the Asia Pacific (“APAC”) region. Company A purchases these products from its parent company.\n\n• Company A conducted a thorough functional analysis which revealed:\n\nFAR\n\nDetails\n\nFunctions Besides distributing the products in the APAC region, Company A undertakes certain functions for the APAC region which include:\n• Setting and managing all marketing strategies and campaigns\n• Conducting market intelligence\n• Analysing consumer demand and the actions of its competitors\n• Determining volume to be sold\n• Setting prices for the products to be sold\n• Conducting credit analysis of customers\n\nAssets\n\nCompany A owns and operates a warehouse to store the products. To ensure orders are processed quickly and to control the inventory level of slow-moving products, Company A utilises a self-inventory management developed automated system to track and process inventories and shipping orders for the APAC region.\n\nRisks\n\nCompany A demonstrated that it assumes credit risk and inventory obsolescence risk as in the examples in paragraph 5.35(c).\n\n• The arm’s length remuneration for Company A should reflect the distribution function as well as the above functions performed, assets used and risks assumed. The level of remuneration for Company A would be higher compared to another company, Company B, that merely distributes products while the above functions, assets and risks remained with Company B’s parent company.\n\nCommercial and economic circumstances\n\nComparability analysis should take into account the commercial and economic circumstances in which the related and independent parties operate.\n\nPrices may vary across different markets even for transactions involving the same property or services. In order to make meaningful comparisons between related party transactions and independent party transactions with regard to their prices or margins, the markets and economic circumstances in which the parties operate or where the transactions are undertaken should be comparable. Such comparisons include:\n\nCircumstances\n\nEconomic circumstances\n\nPossible comparisons\n\n• Availability of substitute goods or services\n• Geographic location\n• Market size\n• Extent of competition in the markets\n• Consumer purchasing power\n• Level of taxpayers in the market at which they operate (for wholesale or retail)\n\nGovernment policies and regulations\n\n• Price controls\n• National insurance\n\nBusiness strategies\n\n• Innovation development and new product\n• Degree of diversification\n• Risk aversion\n• Assessment of political changes\n• Duration of arrangements\n• Other factors bearing upon the daily conduct of business\n\nComparing actual related party transaction with independent party transactions\n\nThe economically relevant characteristics of the actual related party transaction have to be compared with those of independent party transactions in order to determine an arm’s length price for the related party transaction.\n\nWhen making the comparison, these other aspects of comparability analysis are relevant:\n\n(a) Evaluating transactions on a separate or aggregate basis;\n\n(b) Using multiple year data;\n\n(c) Considering losses; and\n\n(d) Selecting comparables.\n\nEvaluating transactions on a separate or aggregate basis\n\nGenerally, the arm’s length principle should be applied on a transaction-by-transaction basis to obtain the most precise approximation of arm’s length conditions.\n\nHowever, where individual transactions are highly inter-related and it can be demonstrated that independent parties in comparable circumstances would typically price the individual transactions on an aggregate basis, taxpayers may consider evaluating the transactions on an aggregate basis.\n\nUsing multiple year data\n\nTo enhance the reliability of the comparability analysis, taxpayers should examine multiple year data as opposed to single year data. Multiple year data helps to identify factors that may have influenced or should have influenced transfer prices, such as long term arrangements and business or product life cycles.\n\nConsidering losses\n\nGenerally, businesses exist with the objective to generate profits. Therefore, a taxpayer transacting with a related party at a loss indicates that the taxpayer may not be compensated at arm’s length.\n\nSimilar to independent parties, a taxpayer transacting with a related party may sustain genuine losses for various reasons such as heavy start-up costs, unfavourable economic conditions, inefficiencies, market penetration business strategy, etc. If so, the claim should be supported with evidence that an independent party would likewise incur losses for a similar period under similar commercial and economic circumstances.\n\nSelecting comparables\n\nA sound comparability analysis requires the selection of reliable comparables. Generally, this is performed prior to or at the time of the related party transactions. These could be either internal or external comparables:\n\nComparables\n\nInternal\n\nCharacteristics\n\nPrice or margin in a comparable transaction between one party which is a party to the related party transaction and an independent party.\n\nExternal\n\nPrice or margin in a comparable transaction between two independent parties, neither of which is a party to the related party transaction.\n\nThe diagram below illustrates internal and external comparables:\n\nComparable circumstances\n\nrelated party transaction\n\nA (taxpayer)\n\nB (related party)\n\nindependent party transaction (internal comparable)\n\nC (independent party)\n\nindependent party transaction (external comparable)\n\nD (independent party)\n\nGenerally, internal comparables may have a more direct and closer relationship to the transaction under review compared to external comparables. Hence, they are preferred because the financial analysis typically would be based on similar accounting standards and information on the comparable transactions would be readily available and more reliable.\n\nInternal comparables may not always be more comparable than external comparables. For example, a taxpayer may sell a significant volume of products to its foreign related party and a much smaller volume to an independent party. The difference in sales volumes is likely to materially affect the comparability of the two transactions. In this case, it may be necessary to search for external comparables that are more comparable.\n\nWhen selecting external comparables, taxpayers should consider the following:\n\n(a) Commercial databases\n\nIRAS does not have a preference for any particular commercial database as long as it provides a reliable source of information that assists taxpayers in performing comparability analysis. Whichever database the taxpayer chooses, transfer pricing documentation should be maintained to demonstrate the results of its comparability analysis.\n\n(b) Comparables with publicly available information\n\nTaxpayers should only use comparables with publicly available information. Such information can be readily obtained from various sources and verified, making the analyses of these comparables more reliable compared to those based on privately held information.\n\nBetween a company that is listed on a stock exchange and one that is not listed, IRAS prefers the former as a comparable because there is generally more information available in the public domain compared to the latter.\n\n(c) Non-local comparables\n\nAs far as possible, taxpayers should use local comparables in their comparability analysis. Generally, these comparables have a higher degree of comparability in terms of their market and economic circumstances compared to non-local comparables. When taxpayers are unable to find sufficiently reliable local comparables, they may expand their search to regional comparables.\n\n(d) Loss-generating comparables\n\nIn conducting their comparability analysis, taxpayers may come across independent parties which have sustained losses over a period of time. If other independent parties have generated profits for a similar period under similar commercial and economic circumstances, the question arises whether the transactions of the loss-making parties are truly reflective of normal business conditions. The persistently loss-making independent parties are therefore likely to be less reliable comparables. Under such circumstances, taxpayers should exclude as comparables independent parties with the following financial results:\n\n• Weighted average loss for the tested period; or\n\n• Loss incurred for more than half of the tested period.\n\nWhere there are differences between the economically relevant characteristics of the actual related party transaction and independent party transactions, it is important to consider whether there is comparability between the transactions and what adjustments may be necessary to achieve comparability.\n\nDesired outcome of Step 1\n\nThe aim of the comparability analysis is a comprehensive assessment and identification of significant similarities and differences (such as product characteristics, functions performed, etc.) between the taxpayers or transactions in question and those entities or transactions to be benchmarked against.\n\nWhere reasonably accurate adjustments could be made for material differences identified, the method of making or computing such adjustments should be documented.\n\nA thorough understanding of the level of comparability is necessary in deciding the choice of transfer pricing method and tested party (see Step 2 below).\n\nStep 2 – Identify the most appropriate transfer pricing method and tested party\n\nThere are five internationally accepted methods for evaluating a taxpayer’s transfer prices or margins against a benchmark based on the prices or margins adopted by independent parties in similar transactions.\n\nThese five methods can be categorised as follows:\n\nTraditional transaction methods Transactional profits methods\n\n• CUP method\n• Resale price method\n• Cost plus method\n\n• Transactional profit split method\n• Transactional net margin method (“TNMM”)\n\nTraditional transaction methods compare the price of related party transactions with that of transactions between independent parties. On the other hand, transactional profits methods compare the profit arising from related party transactions with that generated in independent party transactions.\n\nCUP method\n\nThe CUP method compares the following two prices:\n\n(a) The price charged for properties or services transferred in a related party transaction; and\n\n(b) The price charged for properties or services transferred in an independent party transaction in comparable circumstances.\n\nA difference between the two prices above may suggest that the related parties are not dealing at arm’s length. Therefore, the price in the related party transaction may need to be substituted with the price in the independent party transaction.\n\nThe price or value of a property or service is very sensitive to differing characteristics, functions performed and market conditions, etc. Hence, the CUP method is reliable only if:\n\n(a) There is high level of comparability between the related party transaction and the independent party transaction; or\n\n(b) Reasonably accurate adjustments can be made to eliminate the effects of material differences.\n\nAs the CUP method is the most direct way to determine arm’s length price, it should generally be preferred to the other methods. However, a less direct method is necessary if comparable independent party transactions cannot be found or where reasonably accurate adjustments for differences in comparability cannot be made.\n\nThe CUP method is most suitable to evaluate transactions involving products with very similar characteristics (in terms of type, physical features, quality and quantity transacted, etc.) and undertaken in similar market or economic conditions, such as widely traded commodities. As there should not be much product differentiation for the use of the CUP method, similarities in product characteristics and market or economic conditions are much more significant considerations than the FAR of the taxpayers in determining the suitability of the CUP method.\n\nTaxpayers should rely on internal comparables as far as possible. External comparables may be used if no reliable internal comparable transactions exist. Example 1 and Example 2 in Annex A illustrate the use of an “internal CUP” and an “external CUP” respectively.\n\nResale price method\n\nThe resale price method is applied where a product that has been purchased from a related party is resold to an independent party. Essentially, it values the functions performed by the “reseller” of a product.\n\nIn this method, the resale price to the independent party is reduced by a comparable gross margin (the “resale price margin”) to arrive at the arm’s length price of the product transferred between the related parties.\n\nUnder arm’s length conditions, the resale price margin should allow the reseller to recover its selling and operating costs, and earn a reasonable profit based on its FAR.\n\nAs gross profit margins represent the gross compensation (after cost of sales) for specific FAR, product differences are less critical than under the CUP method. Therefore, where the related and independent party transactions are comparable in all aspects except the product, the resale price method may be more reliable than the CUP method. Nonetheless, the more comparable the products, the more likely the resale price method will produce better results.\n\nIf there are material differences that affect the resale price margin earned in the related and independent party transactions, adjustments should be made to eliminate the effects of those differences.\n\nThe resale price method is most appropriate where the reseller adds relatively little value to the properties. The more value the reseller adds to the properties (for example, via complicated processing or assembly with other products), the harder it is to apply the resale price method. This is especially so where the reseller contributes significantly to creating or maintaining intangible properties, such as trademarks or trade names, in its activities.\n\nTaxpayers should rely on internal comparables as far as possible. External comparables may be used if no reliable internal comparable transactions exist. Example 3 in Annex A illustrates the use of the resale price method.\n\nCost plus method\n\nThe cost plus method focuses on the gross mark up obtained by a supplier for property transferred or services provided to a related purchaser. Essentially, it values the functions performed by the supplier of the property or services.\n\nIn this method, a comparable gross mark up is added to the costs of the supplier of goods or services (“cost base”) in the related party transaction to arrive at the arm’s length price of that transaction.\n\nSimilar to the resale price method, fewer adjustments may be necessary to account for product differences compared to the CUP method. It may be appropriate to focus on other factors of comparability, such as the FAR and economic circumstances of the tested party and the comparable entities.\n\nApplying the cost plus method requires the comparability of the gross mark up and cost base in the related and independent party transactions. If the related and independent party transactions are not comparable in all aspects and the differences have a material effect on the price or margin, adjustments should be made to eliminate the effects of those differences.\n\nGenerally, costs can be classified as follows:\n\nType of cost\n\nDirect costs\n\nIndirect costs\n\nExamples\n\n• Cost of raw materials\n• Cost of labour\n\n• Depreciation\n• Repair and maintenance which may be allocated among several products\n\nOperating expenses\n\n• Marketing\n• General and administrative\n\nIn applying the cost plus method, direct and indirect costs of producing a good or providing a service are normally used to compute the cost base. Such costs are limited to the costs of the supplier of goods or services and should take into account an analysis of the supplier’s FAR. The methods of determining the cost base should be consistent over time.\n\nIf the supplier of goods or services is the tested party and is a taxpayer in Singapore, the cost base should be determined according to the Singapore Financial Reporting Standards. Where necessary, adjustments will be made to ensure the cost base is arm’s length. This means that the cost base may include costs not reflected in the tested party’s accounts.\n\nExample:\n\n• Company A provides services to its related party, Company B.\n• Company B bore certain cost of $100,000 for the benefit of Company A and related to the services provided by A.\n• Company B did not allocate the $100,000 to Company A.\n• Based on an analysis of FAR of Company A and Company B, the $100,000 should be allocated to Company A.\n• In determining the cost base for the services provided to Company B, the cost base will be adjusted to include the $100,000 even though this amount has not been allocated to Company A and is not reflected in its accounts.\n\nTransactional profit split method (residual analysis approach)\n\nThe transactional profit split method is based on the concept of splitting the combined profits of a transaction between related parties in a similar way as how independent parties would under comparable circumstances.\n\nExample:\n\n• Company A is a Singapore manufacturing and sales company for telecommunication products. It developed an original microprocessor and holds the patent for the manufacturing technology. Company F, an overseas subsidiary of SingCo, develops and manufactures mobile equipment using the new microprocessor as well as technology developed by itself.\n\n• Company F is the only manufacturer licensed by SingCo to use the new microprocessor. SingCo purchases all of the mobile equipment manufactured by Company F and sells them to third parties.\n\n• Both companies contribute to the success of the mobile equipment through their design of the microprocessor and the equipment. As the nature of the products is very advanced and unique, the group is unable to locate any comparable with similar intangible assets. Therefore, neither the traditional methods nor the TNMM is appropriate in this case.\n\n• Nevertheless, the group is able to obtain reliable data on handphone contract manufacturers and equipment wholesalers without unique intangible property in the telecommunication industry. The manufacturers earn a mark up of 10% while the wholesalers derive a 25% margin on sales.\n\n• SingCo’s and Company F’s respective share of profit is determined in two stages using the transactional profit split method (residual analysis approach).\n\nStage 1 – Determining the return for routine contributions\n\nThe simplified accounts of SingCo and Company F are shown below:\n\nCompany F (S$)\n\nSingCo (S$)\n\nSales\n\nCost of Goods Sold\n\nGross Margin\n\nSales, General & Admin\n\nOperating Margin\n\n100\n\n(60)\n\n40\n\n(5)\n\n35\n\nThe total operating profit for the group is S$45.\n\nCompany F\n\nCost of goods sold\n\nCost mark up of contract manufacturer (10% x S$60)\n\nTransfer price based on comparables (without intangibles)\n\n125\n\n(100)\n\n25\n\n(15)\n\n10\n\nS$60\n\nS$6\n\nS$66\n\nSingCo\n\nSales to third party customers\n\nS$125\n\nResale margin of wholesalers comparables (without intangibles) 25%\n\nS$31.25\n\nResale margin (or gross margin)\n\nComputation of return for routine contributions based on comparables (without intangibles):\n\nCompany F (S$)\n\nSingCo (S$)\n\nSales\n\nCost of Goods Sold\n\nGross Margin\n\nSales, General & Admin\n\nRoutine operating margin\n\n66\n\n(60)\n\n6\n\n(5)\n\n1\n\nThe total operating margin of the group is S$17.25.\n\n31.25\n\n(15.00)\n\n16.25\n\nStage 2: Dividing the residual profit\n\nThe residual profit of the group = S$45 – S$17.25 = S$27.75\n\nOn further study of the two companies, two particular expense items, research and development (“R&D”) expenses and marketing expenses, are identified as contributing to the key intangibles critical to the success of the mobile equipment. The R&D expenses and marketing expenses incurred by each company are as follows:\n\nSingCo\n\nCompany F\n\nS$12 (80%)\n\nS$3 (20%)\n\nAssuming that the R&D and marketing expenses are equally significant in contributing to the residual profit, based on the proportionate expenses incurred:\n\nSingCo’s share of residual profit (80% x S$27.75)\n\nCompany F’s share of residual profit (20% x S$27.75)\n\nS$22.20\n\nS$5.55\n\nTherefore, the adjusted operating profits of each company are as follows:\n\nSingCo\n\nCompany F\n\n= S$5.55 + S$1\n\n= S$22.20 + S$16.25 = S$38.45\n\nThe adjusted tax accounts are as follows:\n\nSales\n\nCost of Goods Sold\n\nGross Margin\n\nSales, General & Admin\n\nOperating Margin\n\nCompany F (S$)\n\nSingCo (S$)\n\n71.55\n\n(60.00)\n\n11.55\n\n(5.00)\n\n6.55\n\n125.00\n\n(71.55)\n\n53.45\n\n(15.00)\n\n38.45\n\nHence, the transfer price determined using the transactional profit split method (residual analysis approach) should be S$71.55.\n\nExample 6: Transactional net margin method\n\nSingCo is a Singapore manufacturer of dishwashers. All of SingCo’s dishwashers are sold to an overseas related party, Company G, and bear Company G’s brand. Company G, a household electrical appliances brand name, sells only dishwashers manufactured by SingCo.\n\nThe CUP method is not applied in this case because no reliable adjustments can be made to account for differences with similar products in the market.\n\nAfter the appropriate functional analysis, SingCo was able to identify a Singapore manufacturer of home electrical appliances, Company H, as a suitable comparable company. However, Company H performs warranty functions for its independent wholesalers, whereas SingCo does not. Company H realizes a net mark up or operating margin of 10%.\n\nAs the costs pertaining to the warranty functions cannot be separately identified in Company H’s accounts and no reliable adjustments can be made to account for the difference in the functions, it may be more reliable to examine the net margins in this case. The transfer price for SingCo’s sale of dishwashers to Company G is computed using the TNMM as follows:\n\nSingCo’s cost of goods sold\n\nSingCo’s operating expenses\n\nTotal costs\n\nAdd: Net mark up (10% x S$6,500)\n\nTransfer price based on TNMM\n\nS$5,000\n\nS$1,500\n\nS$6,500\n\nS$650\n\nS$7,150\n\nANNEX B – Samples and guides for MAP and APA process\n\nAnnex B1: Sample of letter of authorisation\n\nNote: The letter is to be printed on the taxpayer’s letterhead\n\n[Date]\n\nInternational Tax and Relations Division\nTransfer Pricing and Dispute Resolution Branch\nInland Revenue Authority of Singapore\n55 Newton Road\nSingapore 307987\n\nAttention: [IRAS Case Officer]\n\nLETTER OF AUTHORITY- APPLICATION FOR *[MUTUAL AGREEMENT PROCEDURE (“MAP”)/ BILATERAL ADVANCE PRICING ARRANGEMENT (“BAPA”)/ UNILATERAL ADVANCE PRICING ARRANGEMENT (“UAPA”)] BY [NAME(S) OF TAXPAYER(S)]\n\nDear Sir/ Madam,\n\nThis is to advise that we have appointed [Tax agent/ representative (Name and contact information)] to represent us on all matters relating to the above application. We authorise IRAS to communicate with them and the parties listed below via letters, phone calls, **[electronic means (e.g. emails)], etc. on all matters relating to the above application.\n\n(i) [Authorised party (Name and contact information)]\n\n(ii) [Authorised party (Name and contact information)]\n\nYours faithfully,\n\n[Name of signatory]\n[Designation of signatory]\nName of taxpayer\n\n* Please delete accordingly.\n\n** Please delete if you do not wish that the electronic mode of communication be used for the above application.\n\nAnnex B2: Guide on minimum information required for pre-filing meeting for APA request\n\nS/No. Minimal Information for pre-filing meeting\n\n1 Letter of authorisation stating the engagement of tax agents or other representatives to act for the taxpayer, if applicable\n\n2 Taxpayer’s name, address, tax identification number and contact details\n\n3 Whether request is for unilateral, bilateral or multilateral APA and reasons for the request\n\n4 The foreign competent authority if the request is not relating to unilateral APA\n\n5 Financial years to be covered (“covered period”), including roll-back years, if applicable\n\n6 A brief description of the transactions involved (“covered transactions”)\n\n7 The related parties to the transactions (“covered entities”)\n\n8 How the covered transactions relate to the overall business activities of the covered entities\n\n9 A detailed organisation chart\n\n10 An overview of the functions undertaken, assets employed and risks assumed by the covered entities during the covered period\n\n11 A highlight of how the functions undertaken, assets employed and risks assumed by the covered entities have changed compared to the period prior to the proposed covered period\n\n12 Based on the preliminary or completed transfer pricing analysis, list down the proposed:\n(a) tested party;\n(b) transfer pricing methodology;\n(c) profit level indicator, if relevant; and\n(d) arm’s length result\n\n13 List of critical assumptions under which the proposed APA will operate\n\n14 Any other information which is of relevance\n\nAnnex B3: Sample of an APA agreement\n\nAPA Terms\n\nDescription and examples\n\nCovered entities\n\nThis refers to the related parties to the covered transaction.\n\nExample:\nSingapore entity: ABC Pte Ltd\nDTA entity: XYZ Ltd\n\nCovered transaction(s)\n\nThis refers to the transactions on which an arm’s length remuneration is to be agreed.\n\nExample: Sales of products from XYZ Ltd to ABC Pte Ltd\n\nCovered period\n\nThis refers to the FYs to be covered in the APA.\n\nFuture FYs: Generally up to 5 FYs\nRoll-back years (if applicable): Generally up to 2 FYs\n\nTransfer pricing method\n\nThis is the agreed method on which the arm’s length remuneration is to be determined.\n\nExample: Tested party is ABC Pte Ltd\nTransfer pricing method is transactional net margin method (“TNMM”) with operating margin (“OM”) as the profit level indicator\n\nArm’s length remuneration\n\nThis is the agreed arm’s length remuneration for the covered transaction.\n\nExample: Inter-quartile OM range of D% to E%\n\nCompensating adjustment rules\n\nThe rules set out the basis of determining compensating adjustments.\n\nExample: To adjust the actual OM to the nearest edge of inter-quartile OM range if the actual OM is not within the range\n\nFor example, if actual OM is below D%, to adjust the OM up to D%. If actual OM is above E%, to adjust the OM down to E%.\n\nCritical assumptions\n\nExample: No material changes throughout the covered period to the:\n• economic environment in which the covered entities operate.\n• functions performed, risk assumed and assets employed by the covered entities with respect to the covered transaction.\n• accounting methods and business operations of the covered entities with respect to the covered transaction.\n\nAnnual APA compliance report\n\nThe covered entities are to submit the annual APA compliance report to demonstrate compliance with APA terms by the filing due date of covered entities’ income tax returns.\n\nOthers\n\nAny other terms and conditions\n\nAnnex B4: Guide on annual APA compliance report\n\nThe following information are to be included in the annual APA compliance report to demonstrate compliance with APA terms and critical assumptions in the APA agreement:\n\n1 An analysis and comparison between the tested party’s actual results and the agreed arm’s length remuneration in the agreement.\n\n2 A statement on whether the tested party’s actual results fall within or outside the arm’s length remuneration.\n\n3 An analysis on the factors that cause the tested party’s actual results to fall outside the arm’s length remuneration as well as calculation of the compensating adjustments.\n\n4 A statement on whether the remaining APA terms have been fully complied.\n\n5 A description of any failure to comply with the remaining APA terms.\n\n6 A statement on whether there are significant changes to any aspects of the taxpayer’s business.\n\n7 A description of the significant changes and an analysis of their impact on the APA agreement.\n\n8 A statement on whether any of the critical assumptions may not be valid.\n\n9 A description of the reason why any critical assumptions may not be valid and a proposed course of action.\n\nANNEX C – Routine support services commonly provided on an intra-group basis\n\nThe types of routine support services are specified in the First Schedule of the TP Documentation Rules and are reproduced here:\n\nService\n\nDescription\n\n1. Accounting and auditing\n\nMaintaining accounting records, preparing financial statements based on accounting records, reconciling financial data, ensuring authenticity and reliability of accounting records, performing operational and financial internal audits, and performing other services of a similar nature.\n\n2. Accounts receivable and accounts payable\n\nCollating and verifying data on accounts receivable and accounts payable for the purposes of financial reporting, aging, billing, soliciting payments from customers, payment to vendors, procurement, credit control checking and processing, and other purposes of a similar nature.\n\n3. Budgeting\n\nCompiling data for the purposes of preparing budget estimates and budget reports.\n\n4. Computer support\n\nProviding technical assistance services in relation to usage of computer hardware and software, maintenance of IT infrastructure, troubleshooting support, and other services of a similar nature.\n\n5. Database administration\n\nPerforming general maintenance of computer databases including data storage, but excluding analytic services performed on stored data.\n\n6. Employee benefits administration\n\nAdministrating employee compensation and benefit plans, including healthcare, life insurance, dental, employee incentive compensation and profit sharing, and coordinating with external parties such as hospitals and insurers to implement such benefit plans.\n\n7. General administration\n\nPerforming clerical and administrative functions such as general purchasing, data entry, photocopying or scanning of materials, scheduling appointments, word processing and maintenance of file registries.\n\n8. Legal services\n\nCarrying out any of the following activities by an in-house legal counsel: (a) drafting and reviewing contracts, agreements and other legal documents; (b) performing legal research.\n\n9. Payroll\n\nCompiling and verifying employees’ time worked and claims for reimbursable expenses to compute the salaries, commissions and reimbursements to employees, preparing pay cheques, arranging the crediting of such payments into employees’ bank accounts, and compiling employees’ data to comply with tax requirements.\n\n10. Corporate communications\n\nHandling internal and external communications relating to corporate policies.\n\n11. Staffing and recruiting\n\nManaging staffing requirements, performance issues and staff welfare, and implementing recruitment plans such as advertising open positions, and screening of candidates.\n\n12. Tax\n\nPreparing tax returns and computations and reclaim forms, preparing responses to queries and submitting them to tax authorities, and processing tax payments.\n\n13. Training and employee development\n\nManaging and implementing training and development programmes for employees.\n\n14. Management reporting\n\nCompiling data for management purposes.",
                "pdf_tags": [
                    "Transfer Pricing",
                    "Transfer Pricing Compliance (RPT, TPA)",
                    "Advance Pricing Arrangement (APA)",
                    "Applying the Armճ Length Principle to Related Party Services",
                    "Applying the Armճ Length Principle to Related Party Financial Transactions"
                ],
                "pdf_summary": "**Summary of IRAS e-Tax Guide: Transfer Pricing Guidelines (Seventh Edition)**\n\n**Publication Details:**\n- Published by the Inland Revenue Authority of Singapore (IRAS) on June 14, 2024.\n- This is the seventh edition, with previous editions published between 2006 and 2021.\n\n**Purpose of the Guidelines:**\nThe e-Tax guide provides essential information for taxpayers regarding:\n1. Application of the arm's length principle in transactions with related parties.\n2. Specific transactions, including related party services and loans.\n3. Maintenance of transfer pricing documentation.\n4. Utilization of double taxation agreements (DTA) to resolve transfer pricing disputes.\n5. Understanding the implications of non-compliance with transfer pricing requirements.\n\n**Key Concepts:**\n- **Transfer Pricing:** Refers to the pricing of transactions between related parties, which may differ from market prices due to the lack of independence in their relationships.\n- **Arm's Length Principle:** Transactions between related parties should be priced as if they were between independent parties, ensuring that profits are taxed where economic activities occur.\n- **Double Taxation:** Occurs when two tax authorities claim the same income for taxation. Taxpayers can seek relief through mutual agreement procedures under DTAs.\n\n**Transfer Pricing Methods:**\n1. **Traditional Transaction Methods:**\n   - **Comparable Uncontrolled Price (CUP) Method:** Compares prices of related party transactions with those of independent parties.\n   - **Resale Price Method:** Determines the arm's length price by deducting an appropriate gross margin from the resale price to an independent party.\n   - **Cost Plus Method:** Adds a comparable gross markup to the costs incurred by the supplier in a related party transaction.\n\n2. **Transactional Profits Methods:**\n   - **Transactional Profit Split Method:** Splits combined profits from a transaction between related parties based on their contributions.\n   - **Transactional Net Margin Method (TNMM):** Compares the net profit margin of a taxpayer from a related party transaction to that of comparable independent parties.\n\n**Documentation Requirements:**\nTaxpayers must maintain proper documentation to demonstrate compliance with the arm's length principle, including:\n- Functional analysis of the parties involved.\n- Comparability analysis to identify similar independent transactions.\n- Details of the transfer pricing methods applied.\n\n**Compliance and Adjustments:**\n- IRAS may adjust taxable profits if related party transactions do not adhere to the arm's length principle, potentially leading to double taxation.\n- Taxpayers are encouraged to engage with IRAS for guidance and to resolve any issues regarding compliance.\n\n**Glossary of Key Terms:**\n- **Advance Pricing Arrangement (APA):** An agreement between IRAS and taxpayers on the transfer pricing method to be used for specific transactions.\n- **Competent Authority:** The designated authority (IRAS) responsible for resolving transfer pricing disputes.\n- **Functional Analysis:** Identifies the functions performed, assets used, and risks assumed by each party in a transaction.\n\n**Conclusion:**\nThe e-Tax guide emphasizes the importance of adhering to the arm's length principle in transfer pricing to ensure fair taxation and reduce the risk of double taxation. Taxpayers are encouraged to maintain comprehensive documentation and engage with IRAS for compliance.",
                "pdf_embedding_reference": "article_9_pdf_0.json"
            }
        ],
        "tags": [
            "Transfer Pricing",
            "Transfer Pricing Compliance (RPT, TPA)",
            "Individual Income Tax Bill, Payment, and Refund",
            "Individual Income Tax Compliance",
            "Withholding Tax for Partnership"
        ],
        "_id": "67d16b3aaf834a8f0c318c93",
        "summary": "The article on Transfer Pricing provides essential guidance on tax-related matters in Singapore, particularly focusing on the arm's length principle for related party transactions. Key points include:\n\n- **Arm's Length Principle**: Pricing in related party transactions must reflect independent market conditions.\n- **Documentation**: Taxpayers are required to maintain proper documentation to demonstrate compliance with transfer pricing regulations to avoid penalties.\n- **Government Assistance**: The article discusses how government assistance may impact transfer pricing.\n- **Reporting Requirements**: There are specific requirements for reporting related party transactions.\n- **Penalties**: Non-compliance with transfer pricing documentation can result in penalties.\n\nAdditionally, the article highlights the importance of using official Singapore government agency websites, which end in .gov.sg, and ensuring website security when sharing sensitive information.",
        "embedding_reference": "article_9.json"
    }
]